wilson-elechouse/network_RFID/ESP32S3_LF_HF_Network_RFID/src/NetworkRfidReader.cpp
#include "NetworkRfidReader.h"

#include <driver/gpio.h>
#include <new>
#include <stdio.h>
#include <string.h>
#include <st25r3916_com.h>

#if __has_include(<esp_arduino_version.h>)
#include <esp_arduino_version.h>
#endif

#ifndef ESP_ARDUINO_VERSION_MAJOR
#define ESP_ARDUINO_VERSION_MAJOR 2
#endif

#if __has_include(<esp32-hal-rmt.h>)
#include <esp32-hal-rmt.h>
#endif

#ifndef OUTPUT_OPEN_DRAIN
#define OUTPUT_OPEN_DRAIN OUTPUT
#endif

#if ESP_ARDUINO_VERSION_MAJOR >= 3 && defined(SOC_RMT_SUPPORTED) && SOC_RMT_SUPPORTED
#define NETWORK_RFID_HAS_RMT 1
#else
#define NETWORK_RFID_HAS_RMT 0
#endif

namespace {
constexpr uint32_t kStationConnectTimeoutMs = 15000UL;
constexpr uint32_t kPortalAutoRebootMs = 10UL * 60UL * 1000UL;
constexpr uint32_t kWs2816RmtHz = 10000000UL;
constexpr uint8_t kWs2816T0H = 3;
constexpr uint8_t kWs2816T0L = 10;
constexpr uint8_t kWs2816T1H = 7;
constexpr uint8_t kWs2816T1L = 6;
constexpr uint8_t kWs2816BitsPerPixel = 48;
constexpr uint32_t kButtonDebounceMs = 30;
constexpr uint16_t kButtonBeepGapMs = 120;
constexpr uint16_t kMinProductPulseUs = 20;
constexpr uint16_t kMaxProductPulseUs = 1000;
constexpr uint16_t kMinProductPulseGapUs = 200;
constexpr uint16_t kMaxProductPulseGapUs = 20000;
constexpr const char* kElechouseBrokerHost = "www.elechouse.com";
constexpr uint16_t kElechouseBrokerPort = 9000;
constexpr uint32_t kElechouseHeartbeatMs = 20000UL;
constexpr bool kHfP2pEnabled = false;
constexpr uint32_t kHfCardIsoDepTimeoutMs = 2000UL;
constexpr uint16_t kHfCardRawTxTimeoutMs = 25;
constexpr uint16_t kHfCardFdtListenUs = 100;
constexpr size_t kMaxHfCardPayloadLen = 512;
constexpr size_t kMaxHfCardWifiSsidLen = 32;
constexpr size_t kMaxHfCardWifiPasswordLen = 64;
constexpr uint8_t kT4tFileNone = 0;
constexpr uint8_t kT4tFileCc = 1;
constexpr uint8_t kT4tFileNdef = 2;
constexpr uint16_t kT4tCcFileId = 0xE103;
constexpr uint16_t kT4tNdefFileId = 0xE104;
constexpr size_t kT4tMaxReadChunk = 240;
constexpr uint8_t kIsoDepPcbIBlock = 0x02;
constexpr uint8_t kIsoDepPcbRBlock = 0xA2;
constexpr uint8_t kIsoDepPcbSBlock = 0xC2;
constexpr uint8_t kIsoDepPcbChaining = 0x10;
constexpr uint8_t kIsoDepPcbBlockNumber = 0x01;
constexpr uint8_t kIsoDepPcbTypeMask = 0xC0;
constexpr uint8_t kIsoDepPcbRBlockMask = 0xE0;
constexpr uint8_t kIsoDepPcbSBlockMask = 0xF0;
constexpr uint8_t kIsoDepPcbDeselect = 0xC2;
constexpr uint8_t kIsoDepPcbWtx = 0xF2;
constexpr uint8_t kT4tSwSuccess[] = {0x90, 0x00};
constexpr uint8_t kT4tSwWrongParams[] = {0x6A, 0x86};
constexpr uint8_t kT4tSwFileNotFound[] = {0x6A, 0x82};
constexpr uint8_t kT4tSwConditionsNotSatisfied[] = {0x69, 0x85};
constexpr uint8_t kT4tSwInsNotSupported[] = {0x6D, 0x00};
constexpr uint8_t kT4tNdefAid[] = {0xD2, 0x76, 0x00, 0x00, 0x85, 0x01, 0x01};
constexpr uint16_t kIso14443aCrcInit = 0x6363;
constexpr uint32_t kHfCardRawIrqs = ST25R3916_IRQ_MASK_FWL |
                                    ST25R3916_IRQ_MASK_TXE |
                                    ST25R3916_IRQ_MASK_RXS |
                                    ST25R3916_IRQ_MASK_RXE |
                                    ST25R3916_IRQ_MASK_PAR |
                                    ST25R3916_IRQ_MASK_CRC |
                                    ST25R3916_IRQ_MASK_ERR1 |
                                    ST25R3916_IRQ_MASK_ERR2 |
                                    ST25R3916_IRQ_MASK_NRE |
                                    ST25R3916_IRQ_MASK_EON |
                                    ST25R3916_IRQ_MASK_EOF |
                                    ST25R3916_IRQ_MASK_RX_REST;
constexpr uint32_t kHfCardRawErrorIrqs = ST25R3916_IRQ_MASK_PAR |
                                         ST25R3916_IRQ_MASK_CRC |
                                         ST25R3916_IRQ_MASK_ERR1 |
                                         ST25R3916_IRQ_MASK_ERR2;

uint16_t iso14443aCrc(const uint8_t* data, size_t length) {
  uint16_t crc = kIso14443aCrcInit;
  for (size_t i = 0; i < length; i++) {
    uint8_t byte = data[i] ^ static_cast<uint8_t>(crc & 0xffU);
    byte ^= static_cast<uint8_t>(byte << 4);
    crc = static_cast<uint16_t>((crc >> 8) ^
                                (static_cast<uint16_t>(byte) << 8) ^
                                (static_cast<uint16_t>(byte) << 3) ^
                                (byte >> 4));
  }
  return crc;
}
constexpr uint8_t kT4tCcFile[] = {
  0x00, 0x0F,
  0x20,
  0x00, 0xF6,
  0x00, 0xF6,
  0x04, 0x06,
  0xE1, 0x04,
  0x02, 0x00,
  0x00,
  0xFF,
};

bool isSupportedWiegandBits(uint8_t bits) {
  return bits == 26 || bits == 34 || bits == 37 || bits == 56;
}

void limitString(String& value, size_t maxLength) {
  if (value.length() > maxLength) {
    value.remove(maxLength);
  }
}

bool appendByte(uint8_t* out, size_t maxLength, size_t& pos, uint8_t value) {
  if (pos >= maxLength) {
    return false;
  }
  out[pos++] = value;
  return true;
}

bool appendBytes(uint8_t* out, size_t maxLength, size_t& pos, const uint8_t* data, size_t length) {
  if (length > (maxLength - pos)) {
    return false;
  }
  memcpy(&out[pos], data, length);
  pos += length;
  return true;
}

bool appendStringBytes(uint8_t* out, size_t maxLength, size_t& pos, const String& value) {
  const size_t length = static_cast<size_t>(value.length());
  return appendBytes(out, maxLength, pos, reinterpret_cast<const uint8_t*>(value.c_str()), length);
}

bool appendNdefHeader(uint8_t* out, size_t maxLength, size_t& pos, uint8_t tnf, uint8_t typeLength, size_t payloadLength) {
  const bool shortRecord = payloadLength <= 255U;
  if (!appendByte(out, maxLength, pos, static_cast<uint8_t>(0x80U | 0x40U | (shortRecord ? 0x10U : 0x00U) | (tnf & 0x07U)))) {
    return false;
  }
  if (!appendByte(out, maxLength, pos, typeLength)) {
    return false;
  }
  if (shortRecord) {
    return appendByte(out, maxLength, pos, static_cast<uint8_t>(payloadLength));
  }
  return appendByte(out, maxLength, pos, static_cast<uint8_t>((payloadLength >> 24) & 0xFFU)) &&
         appendByte(out, maxLength, pos, static_cast<uint8_t>((payloadLength >> 16) & 0xFFU)) &&
         appendByte(out, maxLength, pos, static_cast<uint8_t>((payloadLength >> 8) & 0xFFU)) &&
         appendByte(out, maxLength, pos, static_cast<uint8_t>(payloadLength & 0xFFU));
}

size_t appendStatus(uint8_t* out, size_t maxLength, size_t pos, const uint8_t* sw) {
  if ((maxLength - pos) < 2U) {
    return 0;
  }
  out[pos++] = sw[0];
  out[pos++] = sw[1];
  return pos;
}

#if NETWORK_RFID_HAS_RMT
void appendWs2816Word(rmt_data_t* symbols, size_t& index, uint16_t value) {
  for (int bit = 15; bit >= 0; --bit) {
    const bool one = (value & (1U << bit)) != 0;
    symbols[index].level0 = 1;
    symbols[index].duration0 = one ? kWs2816T1H : kWs2816T0H;
    symbols[index].level1 = 0;
    symbols[index].duration1 = one ? kWs2816T1L : kWs2816T0L;
    ++index;
  }
}
#endif
}

NetworkRfidReader* NetworkRfidReader::activeInstance_ = nullptr;

NetworkRfidReader::NetworkRfidReader() = default;

NetworkRfidReader::~NetworkRfidReader() {
  end();
}

bool NetworkRfidReader::begin(const NetworkRfidConfig& config, Stream& console, bool loadSavedConfig) {
  end();

