wilson-elechouse/network_RFID/ESP32S3_LF_HF_Network_RFID/src/NetworkRfidReader.cpp
  config_ = config;
  console_ = &console;
  primaryConsole_ = &console;
  pinMode(0, INPUT_PULLUP);
#if defined(GPIO_NUM_0)
  gpio_pullup_en(GPIO_NUM_0);
  gpio_pulldown_dis(GPIO_NUM_0);
#endif
  if (console_ != nullptr) {
    console_->println();
    console_->println(F("RFID begin"));
  }
  prefsOpen_ = prefs_.begin("lfhf-rfid", false);
  if (loadSavedConfig) {
    loadConfig();
  }
  if (console_ != nullptr) {
    console_->println(loadSavedConfig ? F("RFID config loaded") : F("RFID saved config skipped"));
  }

  activeInstance_ = this;
  if (!wifiDisconnectEventRegistered_) {
    wifiDisconnectEventId_ = WiFi.onEvent(onWiFiEventStatic, ARDUINO_EVENT_WIFI_STA_DISCONNECTED);
    wifiDisconnectEventRegistered_ = true;
  }

  analogReadResolution(12);
  if (config_.pins.lfAdc >= 0) {
    pinMode(config_.pins.lfAdc, INPUT);
  }
  if (config_.pins.lfCarrierDetect >= 0) {
    pinMode(config_.pins.lfCarrierDetect, INPUT);
  }
  if (config_.pins.lfData >= 0) {
    pinMode(config_.pins.lfData, INPUT);
  }
  if (config_.pins.lfPull >= 0) {
    pinMode(config_.pins.lfPull, OUTPUT);
    digitalWrite(config_.pins.lfPull, LOW);
  }
  if (config_.pins.lfOut >= 0) {
    pinMode(config_.pins.lfOut, OUTPUT);
    digitalWrite(config_.pins.lfOut, LOW);
  }

  setupButton();
  setupProductInterface();
  setupFeedback();
  resetPulseQueue();
  em4100_.reset();
  hidProx_.reset();
  if (console_ != nullptr) {
    console_->println(F("RFID pins ready"));
  }

  bool station_connected = false;
  if (config_.wifiSsid.length() > 0) {
    if (console_ != nullptr) {
      console_->print(F("WiFi connecting ssid="));
      console_->println(config_.wifiSsid);
    }
    startWifi();
    const uint32_t wifi_start_ms = millis();
    while (WiFi.status() != WL_CONNECTED && (millis() - wifi_start_ms) < kStationConnectTimeoutMs) {
      serviceButton();
      serviceFeedback();
      delay(50);
    }
    station_connected = WiFi.status() == WL_CONNECTED;
    if (console_ != nullptr) {
      console_->print(F("WiFi "));
      if (station_connected) {
        console_->println(WiFi.localIP().toString());
      } else {
        console_->print(F("connect failed status="));
        console_->print(wifiStatusName(WiFi.status()));
        console_->print(F("("));
        console_->print(static_cast<int>(WiFi.status()));
        console_->print(F(")"));
        if (lastWifiDisconnectReason_ != 0) {
          console_->print(F(" reason="));
          console_->print(lastWifiDisconnectReason_);
          console_->print(F(":"));
          console_->print(WiFi.disconnectReasonName(static_cast<wifi_err_reason_t>(lastWifiDisconnectReason_)));
        }
        console_->println();
      }
    }
    if (!station_connected) {
      wifiConnectInProgress_ = false;
      WiFi.disconnect(false, false);
      delay(100);
    }
  }
  if (!station_connected) {
    config_.configPortalEnabled = true;
    startConfigPortal();
  }

  printHelp();
  if (config_.autoStartLf) {
    if (console_ != nullptr) {
      console_->println(F("LF init starting"));
    }
    setActiveSlot(NetworkRfidSlot::LF);
    if (console_ != nullptr) {
      console_->println(F("LF started"));
    }
  } else if (console_ != nullptr) {
    console_->println(F("LF init skipped; use: lf init"));
  }

  if (config_.autoInitHf) {
    if (console_ != nullptr) {
      console_->println(F("HF init starting"));
    }
    hfReady_ = setupHf();
    if (console_ != nullptr) {
      console_->println(hfReady_ ? F("HF init OK") : F("HF init failed"));
    }
  } else if (console_ != nullptr) {
    console_->println(F("HF init skipped; use: hf init"));
  }

  if (!isLfEnabled() && isHfEnabled()) {
    setActiveSlot(NetworkRfidSlot::HF);
  }

  printStatus();
  return hfReady_;
}

void NetworkRfidReader::end() {
  setLfCapture(false);
  setLfCarrier(false);
  stopFeedbackBuzzer();
  setFeedbackLed(0, 0, 0);
  releaseProductInterface();
  stopHfDiscovery();
  stopConfigPortal();

  if (tcpClient_.connected()) {
    tcpClient_.stop();
  }
  if (serverClient_.connected()) {
    serverClient_.stop();
  }
  if (server_ != nullptr) {
    server_->stop();
    delete server_;
    server_ = nullptr;
  }
  activeServerPort_ = 0;

  releaseHf();
  hfReady_ = false;
  hfDiscoveryActive_ = false;

  if (prefsOpen_) {
    prefs_.end();
    prefsOpen_ = false;
  }
  if (wifiDisconnectEventRegistered_) {
    WiFi.removeEvent(wifiDisconnectEventId_);
    wifiDisconnectEventRegistered_ = false;
    wifiDisconnectEventId_ = 0;
  }

  if (activeInstance_ == this) {
    activeInstance_ = nullptr;
  }
}

void NetworkRfidReader::loop() {
  handleSerial();
  serviceButton();
  serviceConfigPortal();
  serviceNetwork();
  serviceFeedback();

  const uint32_t now = millis();
  const bool lf_enabled = isLfEnabled();
  const bool hf_enabled = isHfEnabled();

  if (!lf_enabled && !hf_enabled) {
    return;
  }

  if (!lf_enabled) {
    if (activeSlot_ != NetworkRfidSlot::HF) {
      setActiveSlot(NetworkRfidSlot::HF);
    }
    if (hf_enabled) {
      serviceHf();
    }
    return;
  }

  if (!hf_enabled) {
    if (activeSlot_ != NetworkRfidSlot::LF) {
      setActiveSlot(NetworkRfidSlot::LF);
    }
    processLfPulses();
    return;
  }

  if (config_.hfRole == NetworkRfidHfRole::CardEmulation) {
    if (activeSlot_ != NetworkRfidSlot::HF) {
      setActiveSlot(NetworkRfidSlot::HF);
    }
    if (hfReady_) {
      serviceHf();
    }
    return;
  }

  if (activeSlot_ == NetworkRfidSlot::LF) {
    processLfPulses();
    const uint32_t lf_window_ms = config_.lfWindowMs == 0 ? 1 : config_.lfWindowMs;
    if ((now - slotStartMs_) >= lf_window_ms) {
      setActiveSlot(NetworkRfidSlot::HF);
    }
    return;
  }

  if (hfReady_) {
    serviceHf();
  }

  const uint32_t hf_window_ms = config_.hfWindowMs == 0 ? 1 : config_.hfWindowMs;
  if ((now - slotStartMs_) >= hf_window_ms) {
    setActiveSlot(NetworkRfidSlot::LF);
  }
}

const NetworkRfidConfig& NetworkRfidReader::config() const {
  return config_;
}

bool NetworkRfidReader::saveConfig() {
  if (!prefsOpen_) {
    prefsOpen_ = prefs_.begin("lfhf-rfid", false);
  }
  if (!prefsOpen_) {
    return false;
  }

  prefs_.putBool("valid", true);
  prefs_.putString("ssid", config_.wifiSsid);
  prefs_.putString("pass", config_.wifiPassword);
  prefs_.putUChar("tcpMode", static_cast<uint8_t>(config_.tcpMode));
  prefs_.putString("host", config_.tcpHost);
  prefs_.putUShort("port", config_.tcpPort);
  prefs_.putUShort("listen", config_.tcpListenPort);
  prefs_.putUChar("fmt", static_cast<uint8_t>(config_.outputFormat));
  prefs_.putBool("tcpEcho", config_.tcpEchoEvents);
  prefs_.putBool("tcpCmd", config_.tcpCommands);
  prefs_.putString("ehCode", config_.elechouseSessionCode);
  prefs_.putUInt("lfHz", config_.lfCarrierHz);
  prefs_.putUInt("lfWin", config_.lfWindowMs);
  prefs_.putUInt("hfWin", config_.hfWindowMs);
  prefs_.putUInt("dedupe", config_.duplicateSuppressMs);
  prefs_.putUInt("reconn", config_.tcpReconnectMs);
  prefs_.putUInt("hfSpiHz", config_.hfSpiHz);
  prefs_.putUInt("hfI2cHz", config_.hfI2cHz);
  prefs_.putUShort("hfDisc", config_.hfDiscoveryDurationMs);
  prefs_.putUInt("hfTechs", config_.hfTechs);
  prefs_.putUChar("hfRole", static_cast<uint8_t>(config_.hfRole));
  prefs_.putString("hfCardUid", config_.hfCardUid);
  prefs_.putUChar("hfNdefTyp", static_cast<uint8_t>(config_.hfCardPayloadType));
  prefs_.putString("hfNdef", config_.hfCardPayload);
  prefs_.putString("hfNdefSsid", config_.hfCardWifiSsid);
  prefs_.putString("hfNdefPass", config_.hfCardWifiPassword);
  prefs_.putString("hfP2pMsg", config_.hfP2pMessage);
  prefs_.putBool("portal", config_.configPortalEnabled);
  prefs_.putString("apSsid", config_.configPortalSsid);
  prefs_.putString("apPass", config_.configPortalPassword);
  prefs_.putUShort("apPort", config_.configPortalPort);
  prefs_.putBool("echo", config_.echoEventsToSerial);
  prefs_.putBool("autoLf", config_.autoStartLf);
  prefs_.putBool("autoHf", config_.autoInitHf);
  prefs_.putBool("fbEn", config_.feedbackEnabled);
  prefs_.putUInt("fbHz", config_.feedbackBuzzerHz);
  prefs_.putUShort("fbBuzzMs", config_.feedbackBuzzerMs);
  prefs_.putUShort("fbSuccMs", config_.feedbackSuccessMs);
  prefs_.putUShort("fbIR", config_.feedbackIdleRed);
  prefs_.putUShort("fbIG", config_.feedbackIdleGreen);
  prefs_.putUShort("fbIB", config_.feedbackIdleBlue);
  prefs_.putUShort("fbSR", config_.feedbackSuccessRed);
  prefs_.putUShort("fbSG", config_.feedbackSuccessGreen);
  prefs_.putUShort("fbSB", config_.feedbackSuccessBlue);
  prefs_.putBool("btnEn", config_.configButtonEnabled);
  prefs_.putUShort("btnCfgMs", config_.buttonWifiConfigMs);
  prefs_.putUShort("btnRstMs", config_.buttonFactoryResetMs);
  prefs_.putBool("uartEn", config_.hardwareUartEnabled);
  prefs_.putUInt("uartBaud", config_.hardwareUartBaud);
  prefs_.putBool("uartEcho", config_.hardwareUartEchoEvents);
  prefs_.putBool("uartCmd", config_.hardwareUartCommands);
  prefs_.putUChar("ifaceMode", static_cast<uint8_t>(config_.productInterfaceMode));
  prefs_.putUChar("wgBits", config_.wiegandBits);
  prefs_.putUShort("pulseUs", config_.productPulseUs);
  prefs_.putUShort("gapUs", config_.productPulseGapUs);
  prefs_.putUChar("abaDigits", config_.abaDigits);
  prefs_.putBool("abaCn", config_.abaUseCardNumber);
  return true;
}

bool NetworkRfidReader::loadConfig() {
  if (!prefsOpen_) {
    prefsOpen_ = prefs_.begin("lfhf-rfid", false);
  }
  if (!prefsOpen_ || !prefs_.isKey("valid")) {
    return false;
  }

  config_.wifiSsid = prefs_.getString("ssid", config_.wifiSsid);
  config_.wifiPassword = prefs_.getString("pass", config_.wifiPassword);
  config_.tcpMode = static_cast<NetworkRfidTcpMode>(prefs_.getUChar("tcpMode", static_cast<uint8_t>(config_.tcpMode)));
  config_.tcpHost = prefs_.getString("host", config_.tcpHost);
  config_.tcpPort = prefs_.getUShort("port", config_.tcpPort);
  config_.tcpListenPort = prefs_.getUShort("listen", config_.tcpListenPort);
  config_.outputFormat = static_cast<NetworkRfidOutputFormat>(prefs_.getUChar("fmt", static_cast<uint8_t>(config_.outputFormat)));
  config_.tcpEchoEvents = prefs_.getBool("tcpEcho", config_.tcpEchoEvents);
  config_.tcpCommands = prefs_.getBool("tcpCmd", config_.tcpCommands);
  config_.elechouseSessionCode = prefs_.getString("ehCode", config_.elechouseSessionCode);
  config_.elechouseSessionCode.trim();
  if (!isValidElechouseSessionCode(config_.elechouseSessionCode)) {
    config_.elechouseSessionCode = "";
  }
  if (config_.tcpMode != NetworkRfidTcpMode::Off &&
      config_.tcpMode != NetworkRfidTcpMode::Client &&
      config_.tcpMode != NetworkRfidTcpMode::Server &&
      config_.tcpMode != NetworkRfidTcpMode::ElechouseTest) {
    config_.tcpMode = NetworkRfidTcpMode::Off;
  }
  config_.lfCarrierHz = prefs_.getUInt("lfHz", config_.lfCarrierHz);
  config_.lfWindowMs = prefs_.getUInt("lfWin", config_.lfWindowMs);
  config_.hfWindowMs = prefs_.getUInt("hfWin", config_.hfWindowMs);
  config_.duplicateSuppressMs = prefs_.getUInt("dedupe", config_.duplicateSuppressMs);
  config_.tcpReconnectMs = prefs_.getUInt("reconn", config_.tcpReconnectMs);
  config_.hfSpiHz = prefs_.getUInt("hfSpiHz", config_.hfSpiHz);
  config_.hfI2cHz = prefs_.getUInt("hfI2cHz", config_.hfI2cHz);
  config_.hfDiscoveryDurationMs = prefs_.getUShort("hfDisc", config_.hfDiscoveryDurationMs);
  config_.hfTechs = static_cast<uint16_t>(prefs_.getUInt("hfTechs", config_.hfTechs));
  config_.hfRole = static_cast<NetworkRfidHfRole>(
      prefs_.getUChar("hfRole", static_cast<uint8_t>(config_.hfRole)));
  if (config_.hfRole != NetworkRfidHfRole::Scan &&
      config_.hfRole != NetworkRfidHfRole::CardEmulation &&
      config_.hfRole != NetworkRfidHfRole::P2p) {
    config_.hfRole = NetworkRfidHfRole::Scan;
  }
  if (!kHfP2pEnabled && config_.hfRole == NetworkRfidHfRole::P2p) {
    config_.hfRole = NetworkRfidHfRole::Scan;
  }
  if (!kHfP2pEnabled) {
    config_.hfTechs &= ~RFAL_NFC_POLL_TECH_AP2P;
  }
  config_.hfCardUid = prefs_.getString("hfCardUid", config_.hfCardUid);
  config_.hfCardPayloadType = static_cast<NetworkRfidHfCardPayloadType>(
      prefs_.getUChar("hfNdefTyp", static_cast<uint8_t>(config_.hfCardPayloadType)));
  if (config_.hfCardPayloadType != NetworkRfidHfCardPayloadType::Url &&
      config_.hfCardPayloadType != NetworkRfidHfCardPayloadType::Text &&
      config_.hfCardPayloadType != NetworkRfidHfCardPayloadType::Vcard &&
      config_.hfCardPayloadType != NetworkRfidHfCardPayloadType::Wifi) {
    config_.hfCardPayloadType = NetworkRfidHfCardPayloadType::Url;
  }
  config_.hfCardPayload = prefs_.getString("hfNdef", config_.hfCardPayload);
  config_.hfCardWifiSsid = prefs_.getString("hfNdefSsid", config_.hfCardWifiSsid);
  config_.hfCardWifiPassword = prefs_.getString("hfNdefPass", config_.hfCardWifiPassword);
  limitString(config_.hfCardPayload, kMaxHfCardPayloadLen);
  limitString(config_.hfCardWifiSsid, kMaxHfCardWifiSsidLen);
  limitString(config_.hfCardWifiPassword, kMaxHfCardWifiPasswordLen);
  config_.hfP2pMessage = prefs_.getString("hfP2pMsg", config_.hfP2pMessage);
  config_.configPortalEnabled = prefs_.getBool("portal", config_.configPortalEnabled);
  config_.configPortalSsid = prefs_.getString("apSsid", config_.configPortalSsid);
  config_.configPortalPassword = prefs_.getString("apPass", config_.configPortalPassword);
  if (config_.configPortalSsid.startsWith("RFID-")) {
    config_.configPortalSsid = "";
  }
  if (config_.configPortalPassword == "rfid123456") {
    config_.configPortalPassword = "";
  }
  config_.configPortalPort = prefs_.getUShort("apPort", config_.configPortalPort);
  if (config_.configPortalPort == 0) {
    config_.configPortalPort = 80;
  }
  config_.echoEventsToSerial = prefs_.getBool("echo", config_.echoEventsToSerial);
  config_.autoStartLf = prefs_.getBool("autoLf", config_.autoStartLf);
  config_.autoInitHf = prefs_.getBool("autoHf", config_.autoInitHf);
  config_.feedbackEnabled = prefs_.getBool("fbEn", config_.feedbackEnabled);
  config_.feedbackBuzzerHz = prefs_.getUInt("fbHz", config_.feedbackBuzzerHz);
  config_.feedbackBuzzerMs = prefs_.getUShort("fbBuzzMs", config_.feedbackBuzzerMs);
  config_.feedbackSuccessMs = prefs_.getUShort("fbSuccMs", config_.feedbackSuccessMs);
  config_.feedbackIdleRed = prefs_.getUShort("fbIR", config_.feedbackIdleRed);
  config_.feedbackIdleGreen = prefs_.getUShort("fbIG", config_.feedbackIdleGreen);
  config_.feedbackIdleBlue = prefs_.getUShort("fbIB", config_.feedbackIdleBlue);
  config_.feedbackSuccessRed = prefs_.getUShort("fbSR", config_.feedbackSuccessRed);
  config_.feedbackSuccessGreen = prefs_.getUShort("fbSG", config_.feedbackSuccessGreen);
  config_.feedbackSuccessBlue = prefs_.getUShort("fbSB", config_.feedbackSuccessBlue);
  config_.configButtonEnabled = prefs_.getBool("btnEn", config_.configButtonEnabled);
  config_.buttonWifiConfigMs = prefs_.getUShort("btnCfgMs", config_.buttonWifiConfigMs);
  config_.buttonFactoryResetMs = prefs_.getUShort("btnRstMs", config_.buttonFactoryResetMs);
  config_.hardwareUartEnabled = prefs_.getBool("uartEn", config_.hardwareUartEnabled);
  config_.hardwareUartBaud = prefs_.getUInt("uartBaud", config_.hardwareUartBaud);
  config_.hardwareUartEchoEvents = prefs_.getBool("uartEcho", config_.hardwareUartEchoEvents);
  config_.hardwareUartCommands = prefs_.getBool("uartCmd", config_.hardwareUartCommands);
  config_.productInterfaceMode = static_cast<NetworkRfidProductInterfaceMode>(
      prefs_.getUChar("ifaceMode", static_cast<uint8_t>(config_.productInterfaceMode)));
  if (config_.productInterfaceMode != NetworkRfidProductInterfaceMode::Uart &&
      config_.productInterfaceMode != NetworkRfidProductInterfaceMode::Wiegand &&
      config_.productInterfaceMode != NetworkRfidProductInterfaceMode::Aba) {
    config_.productInterfaceMode = NetworkRfidProductInterfaceMode::Uart;
  }
  config_.wiegandBits = prefs_.getUChar("wgBits", config_.wiegandBits);
  if (!isSupportedWiegandBits(config_.wiegandBits)) {
    config_.wiegandBits = 34;
  }
  config_.productPulseUs = prefs_.getUShort("pulseUs", config_.productPulseUs);
  if (config_.productPulseUs < kMinProductPulseUs) {
    config_.productPulseUs = kMinProductPulseUs;
  } else if (config_.productPulseUs > kMaxProductPulseUs) {
    config_.productPulseUs = kMaxProductPulseUs;
  }
  config_.productPulseGapUs = prefs_.getUShort("gapUs", config_.productPulseGapUs);
  if (config_.productPulseGapUs < kMinProductPulseGapUs) {
    config_.productPulseGapUs = kMinProductPulseGapUs;
  } else if (config_.productPulseGapUs > kMaxProductPulseGapUs) {
    config_.productPulseGapUs = kMaxProductPulseGapUs;
  }
  config_.abaDigits = prefs_.getUChar("abaDigits", config_.abaDigits);
  if (config_.abaDigits > 32) {
    config_.abaDigits = 32;
  }
  config_.abaUseCardNumber = prefs_.getBool("abaCn", config_.abaUseCardNumber);
  return true;
}

