wilson-elechouse/network_RFID/ESP32S3_LF_HF_Network_RFID/src/NetworkRfidReader.cpp
void NetworkRfidReader::clearSavedConfig() {
  if (!prefsOpen_) {
    prefsOpen_ = prefs_.begin("lfhf-rfid", false);
  }
  if (prefsOpen_) {
    prefs_.clear();
  }
}

void NetworkRfidReader::setCardCallback(NetworkRfidCardCallback callback, void* context) {
  callback_ = callback;
  callbackContext_ = context;
}

void IRAM_ATTR NetworkRfidReader::onLfDataEdgeStatic() {
  if (activeInstance_ != nullptr) {
    activeInstance_->onLfDataEdge();
  }
}

void NetworkRfidReader::onHfStateChangeStatic(rfalNfcState state) {
  if (activeInstance_ != nullptr) {
    activeInstance_->onHfStateChange(state);
  }
}

void NetworkRfidReader::onWiFiEventStatic(arduino_event_id_t event, arduino_event_info_t info) {
  if (activeInstance_ == nullptr || event != ARDUINO_EVENT_WIFI_STA_DISCONNECTED) {
    return;
  }
  activeInstance_->lastWifiDisconnectReason_ = info.wifi_sta_disconnected.reason;
  activeInstance_->lastWifiDisconnectMs_ = millis();
  activeInstance_->wifiConnectInProgress_ = false;
}

void IRAM_ATTR NetworkRfidReader::onLfDataEdge() {
  const uint32_t now = micros();
  const uint32_t duration = now - lastEdgeUs_;
  const uint8_t new_level = gpio_get_level(static_cast<gpio_num_t>(config_.pins.lfData)) ? 1 : 0;

  const uint16_t next_head = (pulseHead_ + 1) & (PulseQueueSize - 1);
  if (next_head != pulseTail_) {
    pulseQueue_[pulseHead_].durationUs = duration > 0xFFFF ? 0xFFFF : static_cast<uint16_t>(duration);
    pulseQueue_[pulseHead_].level = lastDataLevel_;
    pulseHead_ = next_head;
    capturedPulses_++;
  } else {
    droppedPulses_++;
  }

  lastEdgeUs_ = now;
  lastDataLevel_ = new_level;
}

bool NetworkRfidReader::popPulse(PulseSample& pulse) {
  noInterrupts();
  if (pulseTail_ == pulseHead_) {
    interrupts();
    return false;
  }
  pulse.durationUs = pulseQueue_[pulseTail_].durationUs;
  pulse.level = pulseQueue_[pulseTail_].level;
  pulseTail_ = (pulseTail_ + 1) & (PulseQueueSize - 1);
  interrupts();
  return true;
}

void NetworkRfidReader::resetPulseQueue() {
  noInterrupts();
  pulseHead_ = 0;
  pulseTail_ = 0;
  droppedPulses_ = 0;
  capturedPulses_ = 0;
  lastDataLevel_ = (config_.pins.lfData >= 0) ?
    (gpio_get_level(static_cast<gpio_num_t>(config_.pins.lfData)) ? 1 : 0) : 0;
  lastEdgeUs_ = micros();
  interrupts();
}

void NetworkRfidReader::setLfCarrier(bool enabled) {
  if (enabled == lfCarrierEnabled_) {
    return;
  }

  if (config_.pins.lfOut < 0) {
    lfCarrierEnabled_ = false;
    return;
  }

  if (enabled) {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
    if (!ledcAttach(config_.pins.lfOut, config_.lfCarrierHz, 8)) {
      if (console_ != nullptr) {
        console_->println(F("ERR ledcAttach failed"));
      }
      return;
    }
    ledcWrite(config_.pins.lfOut, 128);
#else
    ledcSetup(config_.pins.lfLedcChannel, config_.lfCarrierHz, 8);
    ledcAttachPin(config_.pins.lfOut, config_.pins.lfLedcChannel);
    ledcWrite(config_.pins.lfLedcChannel, 128);
#endif
    lfCarrierEnabled_ = true;
    return;
  }

#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcDetach(config_.pins.lfOut);
#else
  ledcDetachPin(config_.pins.lfOut);
#endif
  pinMode(config_.pins.lfOut, OUTPUT);
  digitalWrite(config_.pins.lfOut, LOW);
  lfCarrierEnabled_ = false;
}

void NetworkRfidReader::setLfCapture(bool enabled) {
  if (enabled == lfCaptureEnabled_) {
    return;
  }
  if (config_.pins.lfData < 0) {
    lfCaptureEnabled_ = false;
    return;
  }

  if (enabled) {
    resetPulseQueue();
    em4100_.reset();
    hidProx_.reset();
    indala_.reset();
    attachInterrupt(digitalPinToInterrupt(config_.pins.lfData), onLfDataEdgeStatic, CHANGE);
    lfCaptureEnabled_ = true;
  } else {
    detachInterrupt(digitalPinToInterrupt(config_.pins.lfData));
    lfCaptureEnabled_ = false;
  }
}

void NetworkRfidReader::setActiveSlot(NetworkRfidSlot slot) {
  if ((slot == activeSlot_) && (slotStartMs_ != 0)) {
    return;
  }

  if (slot == NetworkRfidSlot::LF) {
    stopHfDiscovery();
    if (config_.pins.lfPull >= 0) {
      digitalWrite(config_.pins.lfPull, LOW);
    }
    setLfCarrier(true);
    setLfCapture(true);
  } else {
    setLfCapture(false);
    setLfCarrier(false);
    if (config_.pins.lfPull >= 0) {
      digitalWrite(config_.pins.lfPull, LOW);
    }
    restartHfRole();
  }

  activeSlot_ = slot;
  slotStartMs_ = millis();
}

bool NetworkRfidReader::isLfEnabled() const {
  return config_.autoStartLf;
}

bool NetworkRfidReader::isHfEnabled() const {
  return config_.autoInitHf && hfReady_ && nfc_ != nullptr;
}

void NetworkRfidReader::releaseHf() {
  stopHfDiscovery();
  stopHfCardEmulation();
  hfReady_ = false;
  delete nfc_;
  nfc_ = nullptr;
  delete hfReader_;
  hfReader_ = nullptr;
  delete spi_;
  spi_ = nullptr;
  i2c_ = nullptr;
}

void NetworkRfidReader::processLfPulses() {
  PulseSample pulse = {};
  Em4100Id em_id = {};
  Em4100DecodeInfo em_info = {};
  HidH10301Id h10301 = {};
  HidGenericId generic = {};
  HidDecodeInfo hid_info = {};
  uint16_t processed = 0;

  while (processed < 2048 && popPulse(pulse)) {
    processed++;
    if (lfRawDumpRemaining_ > 0 && console_ != nullptr) {
      console_->print(F("LFRAW level="));
      console_->print(pulse.level ? 1 : 0);
      console_->print(F(" us="));
      console_->println(pulse.durationUs);
      lfRawDumpRemaining_--;
    }

    if (hidProx_.pushPulse(pulse.level != 0, pulse.durationUs, h10301, generic, hid_info)) {
      if (hid_info.h10301) {
        String id = F("FC=");
        id += String(h10301.facility);
        id += F(" CN=");
        id += String(h10301.card);
        id += F(" RAW=");
        id += hexBytes(h10301.raw, sizeof(h10301.raw), true);
        emitCard("LF", "HID-H10301", id);
        lastH10301_ = h10301;
        haveLastH10301_ = true;
        lastH10301EmitMs_ = millis();
      } else if (hid_info.generic) {
        if (generic.bit_size == 26 && haveLastH10301_ && (millis() - lastH10301EmitMs_) < 250UL) {
          continue;
        }
        String id = String(generic.bit_size);
        id += F("-bit ");
        id += hexBytes(generic.data, sizeof(generic.data), true);
        emitCard("LF", "HIDProx", id);
      }
    }

    if (em4100_.pushPulse(pulse.level != 0, pulse.durationUs, em_id, em_info)) {
      emitCard("LF", "EM4100", hexBytes(em_id.bytes, sizeof(em_id.bytes), true));
    }
  }
}

void NetworkRfidReader::processLfHidPulses(uint16_t max_pulses) {
  PulseSample pulse = {};
  HidH10301Id h10301 = {};
  HidGenericId generic = {};
  HidDecodeInfo hid_info = {};
  uint16_t processed = 0;

