wilson-elechouse/network_RFID/ESP32S3_LF_HF_Network_RFID/src/NetworkRfidReader.cpp
  if (config_.pins.hfCs >= 0) {
    pinMode(config_.pins.hfCs, OUTPUT);
    digitalWrite(config_.pins.hfCs, HIGH);
  }
  SPIClass probe_spi(config_.pins.hfSpiBus);
  RfalRfST25R3916Class probe_reader(&probe_spi,
                                    config_.pins.hfCs,
                                    config_.pins.hfIrq,
                                    config_.hfSpiHz);
  probe_spi.begin(config_.pins.hfSck, config_.pins.hfMiso, config_.pins.hfMosi, config_.pins.hfCs);

  uint8_t id = 0;
  const ReturnCode err = probe_reader.st25r3916ReadRegister(ST25R3916_REG_IC_IDENTITY, &id);
  probe_spi.end();

  const uint8_t type = id & ST25R3916_REG_IC_IDENTITY_ic_type_mask;
  const uint8_t rev = id & ST25R3916_REG_IC_IDENTITY_ic_rev_mask;
  const bool match = (type == ST25R3916_REG_IC_IDENTITY_ic_type_st25r3916 ||
                      type == ST25R3916_REG_IC_IDENTITY_ic_type_st25r3916b);

  if (console_ != nullptr) {
    console_->print(F("HF probe err="));
    console_->print(static_cast<int>(err));
    console_->print(F(" identity=0x"));
    if (id < 0x10) {
      console_->print('0');
    }
    console_->print(id, HEX);
    console_->print(F(" type=0x"));
    if (type < 0x10) {
      console_->print('0');
    }
    console_->print(type, HEX);
    console_->print(F(" rev="));
    console_->print(rev);
    console_->print(F(" match="));
    console_->println(match ? F("yes") : F("no"));
  }

  return (err == ERR_NONE) && match;
}

uint16_t NetworkRfidReader::activeHfTechs() const {
  if (kHfP2pEnabled && config_.hfRole == NetworkRfidHfRole::P2p) {
    return RFAL_NFC_POLL_TECH_A | RFAL_NFC_POLL_TECH_F | RFAL_NFC_POLL_TECH_AP2P;
  }
  uint16_t techs = config_.hfTechs == 0 ? RFAL_NFC_POLL_TECH_A : config_.hfTechs;
  if (!kHfP2pEnabled) {
    techs &= ~RFAL_NFC_POLL_TECH_AP2P;
  }
  return techs == 0 ? RFAL_NFC_POLL_TECH_A : techs;
}

void NetworkRfidReader::serviceHf() {
  if (!isHfEnabled()) {
    return;
  }

  if (config_.hfRole == NetworkRfidHfRole::CardEmulation) {
    serviceHfCardEmulation();
    return;
  }

  stopHfCardEmulation();
  if (nfc_ == nullptr) {
    return;
  }
  if (!hfDiscoveryActive_ && !hfDataExchangeActive_) {
    startHfDiscovery();
  }
  nfc_->rfalNfcWorker();
  serviceHfDataExchange();
}

void NetworkRfidReader::restartHfRole() {
  if (!isHfEnabled()) {
    return;
  }

  if (config_.hfRole == NetworkRfidHfRole::CardEmulation) {
    stopHfDiscovery();
    startHfCardEmulation();
  } else {
    stopHfCardEmulation();
    startHfDiscovery();
  }
}

void NetworkRfidReader::startHfDiscovery() {
  if (!hfReady_ || nfc_ == nullptr || hfDiscoveryActive_) {
    return;
  }
  if (config_.hfRole == NetworkRfidHfRole::CardEmulation) {
    return;
  }

  const uint32_t now = millis();
  if ((now - lastHfDiscoverAttemptMs_) < 250U) {
    return;
  }
  lastHfDiscoverAttemptMs_ = now;

  memset(&hfDiscover_, 0, sizeof(hfDiscover_));
  hfDiscover_.compMode = RFAL_COMPLIANCE_MODE_NFC;
  hfDiscover_.devLimit = RFAL_ESP32_DEFAULT_DEVICE_LIMIT;
  hfDiscover_.techs2Find = activeHfTechs();
  hfDiscover_.totalDuration = config_.hfDiscoveryDurationMs;
  hfDiscover_.nfcfBR = RFAL_BR_212;
  hfDiscover_.ap2pBR = RFAL_BR_424;
  const uint8_t nfcid3[RFAL_NFCDEP_NFCID3_LEN] = {
      0x02, 0xFE, 0xDC, 0xBA, 0x98, 0x76, 0x54, 0x32, 0x10, 0x01};
  memcpy(hfDiscover_.nfcid3, nfcid3, sizeof(nfcid3));
  hfDiscover_.notifyCb = onHfStateChangeStatic;

  const ReturnCode err = nfc_->rfalNfcDiscover(&hfDiscover_);
  if (err == ERR_NONE) {
    hfDiscoveryActive_ = true;
  } else if (console_ != nullptr) {
    console_->print(F("HF discovery failed: "));
    console_->println(static_cast<int>(err));
  }
}

void NetworkRfidReader::stopHfDiscovery() {
  if (nfc_ != nullptr && nfc_->rfalNfcGetState() > RFAL_NFC_STATE_IDLE) {
    nfc_->rfalNfcDeactivate(false);
  }
  if (hfReader_ != nullptr) {
    hfReader_->rfalFieldOff();
  }
  hfDiscoveryActive_ = false;
  hfDataExchangeActive_ = false;
  hfExchangeRxData_ = nullptr;
  hfExchangeRxLen_ = nullptr;
}

void NetworkRfidReader::onHfStateChange(rfalNfcState state) {
  if (state != RFAL_NFC_STATE_ACTIVATED || nfc_ == nullptr) {
    return;
  }

  rfalNfcDevice* device = nullptr;
  if (nfc_->rfalNfcGetActiveDevice(&device) == ERR_NONE && device != nullptr) {
    emitCard("HF", hfTypeName(device->type), hexBytes(device->nfcid, device->nfcidLen, true));
    if (kHfP2pEnabled && config_.hfRole == NetworkRfidHfRole::P2p && isHfP2pDevice(device) && beginHfDataExchange(device)) {
      return;
    }
  }

  nfc_->rfalNfcDeactivate(true);
  hfDiscoveryActive_ = true;
}

bool NetworkRfidReader::startHfCardEmulation() {
  if (!hfReady_ || hfReader_ == nullptr || hfCardEmulationActive_) {
    return hfCardEmulationActive_;
  }

  const uint32_t now = millis();
  if ((now - lastHfCardEmuAttemptMs_) < 1000U) {
    return false;
  }
  lastHfCardEmuAttemptMs_ = now;

  uint8_t uid[RFAL_NFCID1_TRIPLE_LEN] = {};
  size_t uid_len = 0;
  if (!parseHexBytes(config_.hfCardUid, uid, sizeof(uid), uid_len) ||
      (uid_len != 4 && uid_len != 7)) {
    if (console_ != nullptr) {
      console_->println(F("ERR hf card uid must be 4 or 7 hex bytes"));
    }
    return false;
  }

  resetHfCardProtocol();
  memset(&hfCardEmuA_, 0, sizeof(hfCardEmuA_));
  hfCardEmuA_.nfcidLen = uid_len == 4 ? RFAL_LM_NFCID_LEN_04 :
                         RFAL_LM_NFCID_LEN_07;
  memcpy(hfCardEmuA_.nfcid, uid, uid_len);
  hfCardEmuA_.SENS_RES[0] = 0x04;
  hfCardEmuA_.SENS_RES[1] = 0x00;
  hfCardEmuA_.SEL_RES = 0x20;
  hfListenRxBits_ = 0;
  memset(hfListenRxBuf_, 0, sizeof(hfListenRxBuf_));
  hfLastLmState_ = RFAL_LM_STATE_NOT_INIT;

  if (nfc_ != nullptr && nfc_->rfalNfcGetState() > RFAL_NFC_STATE_IDLE) {
    nfc_->rfalNfcDeactivate(false);
  }
  hfDiscoveryActive_ = false;
  hfDataExchangeActive_ = false;
  hfReader_->rfalFieldOff();

  const ReturnCode err = hfReader_->rfalListenStart(RFAL_LM_MASK_NFCA,
                                                    &hfCardEmuA_,
                                                    nullptr,
                                                    nullptr,
                                                    hfListenRxBuf_,
                                                    sizeof(hfListenRxBuf_) * 8U,
                                                    &hfListenRxBits_);
  if (err != ERR_NONE) {
    if (console_ != nullptr) {
      console_->print(F("HF card emulation failed: "));
      console_->println(static_cast<int>(err));
      if (err == ERR_NOTSUPP) {
        console_->println(F("HF card emulation is not implemented in the ST25R3916 RF driver yet"));
      }
    }
    return false;
  }

  hfCardEmulationActive_ = true;
  if (console_ != nullptr) {
    console_->print(F("HF card emulation active uid="));
    console_->println(hexBytes(hfCardEmuA_.nfcid, uid_len, true));
  }
  return true;
}

void NetworkRfidReader::stopHfCardEmulation() {
  if (hfReader_ != nullptr && hfCardEmulationActive_) {
    hfReader_->rfalListenStop();
  }
  hfCardEmulationActive_ = false;
  resetHfCardProtocol();
}

void NetworkRfidReader::serviceHfCardEmulation() {
  if (!hfCardEmulationActive_) {
    startHfCardEmulation();
    return;
  }

  if (hfReader_ == nullptr) {
    hfCardEmulationActive_ = false;
    return;
  }

  if (hfCardIsoDepActive_) {
    serviceHfCardIsoDep();
    return;
  }

