wilson-elechouse/network_RFID/ESP32S3_LF_HF_Network_RFID/src/NetworkRfidReader.cpp
  hfReader_->rfalWorker();
  bool data_flag = false;
  rfalBitRate last_br = RFAL_BR_106;
  const rfalLmState state = hfReader_->rfalListenGetState(&data_flag, &last_br);
  const bool stateChanged = (state != hfLastLmState_);

  if (data_flag && hfListenRxBits_ > 0) {
    const size_t rx_bytes = (hfListenRxBits_ + 7U) / 8U;
    const bool handled = handleHfCardListenFrame(hfListenRxBuf_, rx_bytes);
    if (stateChanged) {
      hfLastLmState_ = state;
      if (console_ != nullptr) {
        console_->print(F("HF card state="));
        console_->println(hfLmStateName(state));
      }
    }
    if (!handled) {
      emitCard("HF", "CARD-RX", hexBytes(hfListenRxBuf_, rx_bytes, true));
      hfReader_->rfalListenSetState(state);
    }
    return;
  }

  if (stateChanged) {
    hfLastLmState_ = state;
    if (console_ != nullptr) {
      console_->print(F("HF card state="));
      console_->println(hfLmStateName(state));
    }
  }
}

void NetworkRfidReader::resetHfCardProtocol() {
  hfLastLmState_ = RFAL_LM_STATE_NOT_INIT;
  hfListenRxBits_ = 0;
  hfCardIsoDepActive_ = false;
  hfCardIsoDepStartMs_ = 0;
  hfCardExpectedBlock_ = 0;
  hfCardSelectedFile_ = kT4tFileNone;
  hfCardTxLen_ = 0;
  hfCardLastTxLen_ = 0;
}

bool NetworkRfidReader::handleHfCardListenFrame(const uint8_t* data, size_t length) {
  if (data == nullptr || length < 2U || data[0] != 0xE0U) {
    return false;
  }

  const uint8_t ats[] = {
    0x05,  // TL
    0x78,  // FSCI=8, TA/TB/TC present
    0x00,  // 106 kbps only
    0x80,  // FWI=8, SFGI=0
    0x00,  // no DID/NAD
  };

  hfCardIsoDepActive_ = true;
  hfCardIsoDepStartMs_ = millis();
  hfCardExpectedBlock_ = 0;
  hfCardSelectedFile_ = kT4tFileNone;
  hfReader_->rfalListenSetState(RFAL_LM_STATE_CARDEMU_4A);

  const bool sent = sendHfCardIsoDepFrame(ats, sizeof(ats), true);
  if (sent && console_ != nullptr) {
    console_->print(F("HF card RATS -> ATS field="));
    console_->println(hfReader_->rfalIsExtFieldOn() ? F("on") : F("off"));
  }
  return sent;
}

void NetworkRfidReader::serviceHfCardIsoDep() {
  size_t rx_bytes = 0;
  const ReturnCode ret = pollHfCardRawFrame(rx_bytes);
  if (ret == ERR_BUSY) {
    if (hfCardIsoDepStartMs_ != 0U && (millis() - hfCardIsoDepStartMs_) > kHfCardIsoDepTimeoutMs) {
      if (console_ != nullptr) {
        console_->println(F("HF card ISO-DEP raw RX timeout"));
      }
      restartHfCardEmulation();
    }
    return;
  }

  if (ret != ERR_NONE) {
    if (ret == ERR_INCOMPLETE_BYTE || ret == ERR_CRC || ret == ERR_PAR || ret == ERR_FRAMING) {
      if (console_ != nullptr) {
        console_->print(F("HF card ISO-DEP raw RX discarded: "));
        console_->println(static_cast<int>(ret));
      }
      hfReader_->st25r3916EnableInterrupts(kHfCardRawIrqs);
      hfReader_->st25r3916ExecuteCommand(ST25R3916_CMD_UNMASK_RECEIVE_DATA);
      return;
    }
    if (console_ != nullptr && ret != ERR_TIMEOUT) {
      console_->print(F("HF card ISO-DEP raw RX stopped: "));
      console_->println(static_cast<int>(ret));
    }
    restartHfCardEmulation();
    return;
  }

  hfCardIsoDepStartMs_ = millis();
  if (!handleHfCardIsoDepFrame(hfListenRxBuf_, rx_bytes)) {
    restartHfCardEmulation();
  }
}

bool NetworkRfidReader::handleHfCardIsoDepFrame(const uint8_t* frame, size_t length) {
  if (frame == nullptr || length == 0U) {
    return false;
  }

  const uint8_t pcb = frame[0];

  if ((pcb & kIsoDepPcbTypeMask) == 0xC0U) {
    if ((pcb & 0xF0U) == (kIsoDepPcbWtx & 0xF0U)) {
      const uint8_t wtxm = (length > 1U) ? frame[1] : 1U;
      uint8_t response[] = {kIsoDepPcbWtx, wtxm};
      return sendHfCardIsoDepFrame(response, sizeof(response), true);
    }

    uint8_t response[] = {kIsoDepPcbDeselect};
    sendHfCardIsoDepFrame(response, sizeof(response), false);
    hfCardEmulationActive_ = false;
    resetHfCardProtocol();
    lastHfCardEmuAttemptMs_ = 0;
    startHfCardEmulation();
    return true;
  }

  if ((pcb & kIsoDepPcbRBlockMask) == 0x80U) {
    if (hfCardLastTxLen_ > 0U) {
      return sendHfCardIsoDepFrame(hfCardLastTxBuf_, hfCardLastTxLen_, true);
    }
    uint8_t rack[] = {static_cast<uint8_t>(kIsoDepPcbRBlock | (hfCardExpectedBlock_ & kIsoDepPcbBlockNumber))};
    return sendHfCardIsoDepFrame(rack, sizeof(rack), true);
  }

  if ((pcb & kIsoDepPcbTypeMask) != 0x00U) {
    return false;
  }

  const uint8_t rxBlock = (pcb & kIsoDepPcbBlockNumber);
  if (rxBlock != hfCardExpectedBlock_ && hfCardLastTxLen_ > 0U) {
    return sendHfCardIsoDepFrame(hfCardLastTxBuf_, hfCardLastTxLen_, true);
  }

  size_t infPos = 1;
  if ((pcb & 0x08U) != 0U) {
    infPos++;
  }
  if ((pcb & 0x04U) != 0U) {
    infPos++;
  }
  if (infPos > length) {
    return false;
  }

  if ((pcb & kIsoDepPcbChaining) != 0U) {
    hfCardExpectedBlock_ ^= 1U;
    uint8_t rack[] = {static_cast<uint8_t>(kIsoDepPcbRBlock | (hfCardExpectedBlock_ & kIsoDepPcbBlockNumber))};
    return sendHfCardIsoDepFrame(rack, sizeof(rack), true);
  }

  const size_t apduLen = length - infPos;
  const size_t respLen = buildHfT4tApduResponse(&frame[infPos], apduLen, &hfCardTxBuf_[1], sizeof(hfCardTxBuf_) - 1U);
  if (respLen == 0U) {
    return false;
  }

  hfCardTxBuf_[0] = static_cast<uint8_t>(kIsoDepPcbIBlock | rxBlock);
  hfCardExpectedBlock_ = rxBlock ^ 1U;
  return sendHfCardIsoDepFrame(hfCardTxBuf_, respLen + 1U, true);
}

bool NetworkRfidReader::sendHfCardIsoDepFrame(const uint8_t* frame, size_t length, bool expectRx) {
  if (hfReader_ == nullptr || frame == nullptr || length == 0U || length > (sizeof(hfCardTxBuf_) - 2U)) {
    return false;
  }

  memcpy(hfCardLastTxBuf_, frame, length);
  hfCardLastTxLen_ = static_cast<uint16_t>(length);
  hfListenRxBits_ = 0;

  memmove(hfCardTxBuf_, frame, length);
  const uint16_t crc = iso14443aCrc(hfCardTxBuf_, length);
  hfCardTxBuf_[length] = static_cast<uint8_t>(crc & 0xffU);
  hfCardTxBuf_[length + 1U] = static_cast<uint8_t>((crc >> 8) & 0xffU);
  const size_t txLength = length + 2U;

  ReturnCode err = hfReader_->st25r3916ExecuteCommand(ST25R3916_CMD_CLEAR_FIFO);
  if (err == ERR_NONE) {
    err = hfReader_->st25r3916ChangeRegisterBits(ST25R3916_REG_ISO14443A_NFC,
                                                 ST25R3916_REG_ISO14443A_NFC_no_tx_par |
                                                   ST25R3916_REG_ISO14443A_NFC_no_rx_par |
                                                   ST25R3916_REG_ISO14443A_NFC_nfc_f0,
                                                 ST25R3916_REG_ISO14443A_NFC_no_tx_par_off |
                                                   ST25R3916_REG_ISO14443A_NFC_no_rx_par_off |
                                                   ST25R3916_REG_ISO14443A_NFC_nfc_f0_off);
  }
  if (err == ERR_NONE) {
    hfReader_->st25r3916SetNumTxBits(static_cast<uint16_t>(txLength * 8U));
    hfReader_->st25r3916ClearAndEnableInterrupts(kHfCardRawIrqs);
    err = hfReader_->st25r3916WriteFifo(hfCardTxBuf_, static_cast<uint16_t>(txLength));
  }
  if (err == ERR_NONE) {
    delayMicroseconds(kHfCardFdtListenUs);
    err = hfReader_->st25r3916ExecuteCommand(ST25R3916_CMD_TRANSMIT_WITHOUT_CRC);
  }
  if (err != ERR_NONE) {
    if (console_ != nullptr) {
      console_->print(F("HF card raw TX start failed: "));
      console_->println(static_cast<int>(err));
    }
    return false;
  }

  const uint32_t tx_irqs = hfReader_->st25r3916WaitForInterruptsTimed(ST25R3916_IRQ_MASK_TXE |
                                                                        kHfCardRawErrorIrqs |
                                                                        ST25R3916_IRQ_MASK_EOF,
                                                                      kHfCardRawTxTimeoutMs);
  if ((tx_irqs & kHfCardRawErrorIrqs) != 0U) {
    if (console_ != nullptr) {
      console_->print(F("HF card raw TX error irq=0x"));
      console_->println(tx_irqs, HEX);
    }
    return false;
  }
  if ((tx_irqs & ST25R3916_IRQ_MASK_TXE) == 0U) {
    if (console_ != nullptr) {
      console_->print(F("HF card raw TX timeout irq=0x"));
      console_->println(tx_irqs, HEX);
    }
    return false;
  }

  if (expectRx) {
    hfReader_->st25r3916EnableInterrupts(kHfCardRawIrqs);
    hfReader_->st25r3916ExecuteCommand(ST25R3916_CMD_UNMASK_RECEIVE_DATA);
  }
  hfCardIsoDepStartMs_ = expectRx ? millis() : 0U;
  return true;
}

ReturnCode NetworkRfidReader::pollHfCardRawFrame(size_t& rxBytes) {
  rxBytes = 0;
  if (hfReader_ == nullptr) {
    return ERR_WRONG_STATE;
  }

