wilson-elechouse/network_RFID/ESP32S3_LF_HF_Network_RFID/src/NetworkRfidReader.cpp
  const uint32_t irqs = hfReader_->st25r3916GetInterrupt(kHfCardRawIrqs);
  if (irqs == 0U) {
    return ERR_BUSY;
  }

  if ((irqs & kHfCardRawErrorIrqs) != 0U) {
    hfReader_->st25r3916ExecuteCommand(ST25R3916_CMD_CLEAR_FIFO);
    if ((irqs & ST25R3916_IRQ_MASK_CRC) != 0U) {
      return ERR_CRC;
    }
    if ((irqs & ST25R3916_IRQ_MASK_PAR) != 0U) {
      return ERR_PAR;
    }
    return ERR_FRAMING;
  }

  if ((irqs & ST25R3916_IRQ_MASK_RXE) == 0U) {
    return ERR_BUSY;
  }

  const uint16_t fifoBytes = hfReader_->st25r3916GetNumFIFOBytes();
  const uint8_t lastBits = hfReader_->st25r3916GetNumFIFOLastBits();
  if (lastBits != 0U) {
    uint8_t partial[4] = {};
    const uint16_t partialBytes = static_cast<uint16_t>((fifoBytes < sizeof(partial)) ? fifoBytes : sizeof(partial));
    if (partialBytes > 0U) {
      hfReader_->st25r3916ReadFifo(partial, partialBytes);
    }
    if (console_ != nullptr) {
      console_->print(F("HF card raw RX incomplete fifo="));
      console_->print(fifoBytes);
      console_->print(F(" lastBits="));
      console_->print(lastBits);
      if (partialBytes > 0U) {
        console_->print(F(" data="));
        console_->print(hexBytes(partial, partialBytes, true));
      }
      console_->println();
    }
    hfReader_->st25r3916ExecuteCommand(ST25R3916_CMD_CLEAR_FIFO);
    return ERR_INCOMPLETE_BYTE;
  }

  if (fifoBytes == 0U) {
    return ERR_BUSY;
  }

  const uint16_t readBytes = static_cast<uint16_t>(min(static_cast<size_t>(fifoBytes), sizeof(hfListenRxBuf_)));
  ReturnCode err = hfReader_->st25r3916ReadFifo(hfListenRxBuf_, readBytes);
  hfReader_->st25r3916ExecuteCommand(ST25R3916_CMD_CLEAR_FIFO);
  if (err != ERR_NONE) {
    return err;
  }
  if (fifoBytes > sizeof(hfListenRxBuf_)) {
    return ERR_NOMEM;
  }

  rxBytes = readBytes;
  if (rxBytes >= 2U) {
    rxBytes -= 2U;
  }
  hfListenRxBits_ = static_cast<uint16_t>(rxBytes * 8U);
  return (rxBytes > 0U) ? ERR_NONE : ERR_TIMEOUT;
}

void NetworkRfidReader::restartHfCardEmulation() {
  hfCardEmulationActive_ = false;
  resetHfCardProtocol();
  lastHfCardEmuAttemptMs_ = 0;
  startHfCardEmulation();
}

size_t NetworkRfidReader::buildHfNdefMessage(uint8_t* out, size_t maxLength) const {
  if (out == nullptr || maxLength == 0U) {
    return 0;
  }

  size_t pos = 0;
  if (config_.hfCardPayloadType == NetworkRfidHfCardPayloadType::Url) {
    const String payload = config_.hfCardPayload.length() > 0 ? config_.hfCardPayload : String(F("https://www.elechouse.com/"));
    const size_t payloadLen = 1U + static_cast<size_t>(payload.length());
    if (!appendNdefHeader(out, maxLength, pos, 0x01, 1, payloadLen) ||
        !appendByte(out, maxLength, pos, 'U') ||
        !appendByte(out, maxLength, pos, 0x00) ||
        !appendStringBytes(out, maxLength, pos, payload)) {
      return 0;
    }
    return pos;
  }

  if (config_.hfCardPayloadType == NetworkRfidHfCardPayloadType::Vcard) {
    const char mime[] = "text/vcard";
    const size_t payloadLen = static_cast<size_t>(config_.hfCardPayload.length());
    if (!appendNdefHeader(out, maxLength, pos, 0x02, static_cast<uint8_t>(strlen(mime)), payloadLen) ||
        !appendBytes(out, maxLength, pos, reinterpret_cast<const uint8_t*>(mime), strlen(mime)) ||
        !appendStringBytes(out, maxLength, pos, config_.hfCardPayload)) {
      return 0;
    }
    return pos;
  }

  String payload;
  if (config_.hfCardPayloadType == NetworkRfidHfCardPayloadType::Wifi) {
    payload = F("WIFI:T:WPA;S:");
    payload += config_.hfCardWifiSsid;
    payload += F(";P:");
    payload += config_.hfCardWifiPassword;
    payload += F(";;");
  } else {
    payload = config_.hfCardPayload;
  }

  const size_t payloadLen = 3U + static_cast<size_t>(payload.length());
  if (!appendNdefHeader(out, maxLength, pos, 0x01, 1, payloadLen) ||
      !appendByte(out, maxLength, pos, 'T') ||
      !appendByte(out, maxLength, pos, 0x02) ||
      !appendByte(out, maxLength, pos, 'e') ||
      !appendByte(out, maxLength, pos, 'n') ||
      !appendStringBytes(out, maxLength, pos, payload)) {
    return 0;
  }
  return pos;
}

size_t NetworkRfidReader::buildHfNdefFile(uint8_t* out, size_t maxLength) const {
  if (out == nullptr || maxLength < 2U) {
    return 0;
  }

  const size_t ndefLen = buildHfNdefMessage(&out[2], maxLength - 2U);
  if (ndefLen == 0U || ndefLen > 0xFFFEU) {
    return 0;
  }

  out[0] = static_cast<uint8_t>((ndefLen >> 8) & 0xFFU);
  out[1] = static_cast<uint8_t>(ndefLen & 0xFFU);
  return ndefLen + 2U;
}

size_t NetworkRfidReader::buildHfT4tApduResponse(const uint8_t* apdu, size_t apduLen, uint8_t* out, size_t maxLength) {
  if (apdu == nullptr || out == nullptr || maxLength < 2U || apduLen < 2U) {
    return appendStatus(out, maxLength, 0, kT4tSwWrongParams);
  }

  const uint8_t ins = apdu[1];
  if (ins == 0xA4U) {
    if (apduLen < 5U) {
      return appendStatus(out, maxLength, 0, kT4tSwWrongParams);
    }

    const uint8_t p1 = apdu[2];
    const uint8_t lc = apdu[4];
    if (apduLen < (5U + lc)) {
      return appendStatus(out, maxLength, 0, kT4tSwWrongParams);
    }

    const uint8_t* data = &apdu[5];
    if (p1 == 0x04U) {
      if (lc == sizeof(kT4tNdefAid) && memcmp(data, kT4tNdefAid, sizeof(kT4tNdefAid)) == 0) {
        hfCardSelectedFile_ = kT4tFileNone;
        return appendStatus(out, maxLength, 0, kT4tSwSuccess);
      }
      return appendStatus(out, maxLength, 0, kT4tSwFileNotFound);
    }

    if (lc == 2U) {
      const uint16_t fileId = (static_cast<uint16_t>(data[0]) << 8) | data[1];
      if (fileId == kT4tCcFileId) {
        hfCardSelectedFile_ = kT4tFileCc;
        return appendStatus(out, maxLength, 0, kT4tSwSuccess);
      }
      if (fileId == kT4tNdefFileId) {
        hfCardSelectedFile_ = kT4tFileNdef;
        return appendStatus(out, maxLength, 0, kT4tSwSuccess);
      }
    }
    return appendStatus(out, maxLength, 0, kT4tSwFileNotFound);
  }

  if (ins == 0xB0U) {
    if (apduLen < 5U) {
      return appendStatus(out, maxLength, 0, kT4tSwWrongParams);
    }

    const uint16_t offset = (static_cast<uint16_t>(apdu[2] & 0x7FU) << 8) | apdu[3];
    uint16_t le = apdu[4];
    if (le == 0U) {
      le = 256U;
    }

    const uint8_t* source = nullptr;
    size_t sourceLen = 0;
    if (hfCardSelectedFile_ == kT4tFileCc) {
      source = kT4tCcFile;
      sourceLen = sizeof(kT4tCcFile);
    } else if (hfCardSelectedFile_ == kT4tFileNdef) {
      sourceLen = buildHfNdefFile(hfCardNdefFile_, sizeof(hfCardNdefFile_));
      source = hfCardNdefFile_;
    } else {
      return appendStatus(out, maxLength, 0, kT4tSwConditionsNotSatisfied);
    }

