wilson-elechouse/network_RFID/ESP32S3_LF_HF_Network_RFID/src/NetworkRfidReader.cpp
bool NetworkRfidReader::captureIndalaSamples(
  uint16_t requestedSamples,
  IndalaId& id,
  IndalaDecodeInfo& info,
  size_t& samplesRead) {
  samplesRead = 0;
  memset(&info, 0, sizeof(info));

  if (config_.pins.lfData < 0) {
    return false;
  }

  const bool restore_capture = lfCaptureEnabled_;
  if (restore_capture) {
    setLfCapture(false);
  }
  if (!lfCarrierEnabled_) {
    setLfCarrier(true);
  }

  delay(20);

  const int pin = config_.pins.lfData;
  pinMode(pin, INPUT);

  static constexpr uint8_t kSamplePeriodUs = 2;
  bool decoded = false;
  IndalaDecoder decoder;
  decoder.reset();

  bool current_level = gpio_get_level(static_cast<gpio_num_t>(pin)) != 0;
  uint16_t run_samples = 0;
  uint32_t next_sample_us = micros();

  for (uint16_t i = 0; i < requestedSamples; i++) {
    while (static_cast<int32_t>(micros() - next_sample_us) < 0) {
      // tight timing loop for LF diagnostic sampling
    }
    next_sample_us += kSamplePeriodUs;

    const bool level = gpio_get_level(static_cast<gpio_num_t>(pin)) != 0;
    if (level == current_level && run_samples < 0x7FFF) {
      run_samples++;
    } else {
      if (run_samples > 0) {
        decoded = decoder.pushPulse(
          current_level,
          static_cast<uint32_t>(run_samples) * kSamplePeriodUs,
          id,
        info);
        if (decoded) {
          samplesRead = i;
          break;
        }
      }
      current_level = level;
      run_samples = 1;
    }
  }

  if (!decoded && run_samples > 0) {
    decoded = decoder.pushPulse(
      current_level,
      static_cast<uint32_t>(run_samples) * kSamplePeriodUs,
      id,
      info);
  }
  if (!decoded) {
    decoded = decoder.finish(id, info);
    samplesRead = requestedSamples;
  }
  if (decoded && samplesRead == 0) {
    samplesRead = requestedSamples;
  }

  // Keep GPIO edge capture disabled after this diagnostic. Indala PSK presents
  // carrier-rate edges on LF DATA, which can overwhelm the ISR path while the
  // command is printing diagnostics.
  (void) restore_capture;

  return decoded;
}

void NetworkRfidReader::handleHfCommand(String rest) {
  const String sub = lowerCopy(nextToken(rest));
  if (sub.length() == 0 || sub == "status") {
    console_->print(F("HF bus="));
    console_->print(hfBusModeName(config_.pins.hfBusMode));
    console_->print(F(" role="));
    console_->print(hfRoleName(config_.hfRole));
    console_->print(F(" ready="));
    console_->print(hfReady_ ? F("yes") : F("no"));
    console_->print(F(" discovery="));
    console_->print(hfDiscoveryActive_ ? F("yes") : F("no"));
    console_->print(F(" cardEmu="));
    console_->print(hfCardEmulationActive_ ? F("yes") : F("no"));
    console_->print(F(" p2p=disabled"));
    console_->print(F(" cardType=nfc-a-t4t ndef="));
    console_->print(hfCardPayloadTypeName(config_.hfCardPayloadType));
    console_->print(F(" spiHz="));
    console_->print(config_.hfSpiHz);
    console_->print(F(" i2cHz="));
    console_->print(config_.hfI2cHz);
    console_->print(F(" techs=0x"));
    console_->println(activeHfTechs(), HEX);
    return;
  }

  if (sub == "probe") {
    probeHfIdentity();
    return;
  }

  if (sub == "mode" || sub == "role") {
    const String mode = lowerCopy(nextToken(rest));
    if (mode == "scan" || mode == "reader" || mode == "poll") {
      config_.hfRole = NetworkRfidHfRole::Scan;
    } else if (mode == "card" || mode == "emu" || mode == "cardemu" || mode == "listen") {
      config_.hfRole = NetworkRfidHfRole::CardEmulation;
      config_.autoInitHf = true;
      if (!hfReady_) {
        hfReady_ = setupHf();
      }
    } else if (mode == "p2p" || mode == "peer") {
      console_->println(F("ERR hf p2p disabled"));
      return;
    } else {
      console_->println(F("ERR hf mode scan|card"));
      return;
    }
    restartHfRole();
    console_->print(F("OK hf mode="));
    console_->println(hfRoleName(config_.hfRole));
    return;
  }

  if (sub == "scan" || sub == "reader") {
    config_.hfRole = NetworkRfidHfRole::Scan;
    restartHfRole();
    console_->println(F("OK hf mode=scan"));
    return;
  }

  if (sub == "tech" || sub == "techs") {
    const String tech = lowerCopy(nextToken(rest));
    const String value = lowerCopy(nextToken(rest));
    if (tech.length() == 0 || value.length() == 0) {
      console_->println(F("ERR hf tech a|b|f|v on|off"));
      return;
    }
    uint16_t mask = 0;
    if (tech == "a" || tech == "14443a") {
      mask = RFAL_NFC_POLL_TECH_A;
    } else if (tech == "b" || tech == "14443b") {
      mask = RFAL_NFC_POLL_TECH_B;
    } else if (tech == "f" || tech == "nfcf") {
      mask = RFAL_NFC_POLL_TECH_F;
    } else if (tech == "v" || tech == "15693") {
      mask = RFAL_NFC_POLL_TECH_V;
    } else if (tech == "p2p" || tech == "ap2p") {
      console_->println(F("ERR hf p2p disabled"));
      return;
    } else {
      console_->println(F("ERR hf tech a|b|f|v on|off"));
      return;
    }
    if (value == "on" || value == "1") {
      config_.hfTechs |= mask;
    } else if (value == "off" || value == "0") {
      config_.hfTechs &= ~mask;
    } else {
      console_->println(F("ERR hf tech a|b|f|v on|off"));
      return;
    }
    stopHfDiscovery();
    console_->print(F("OK hf techs=0x"));
    console_->println(config_.hfTechs, HEX);
    return;
  }

  if (sub == "card" || sub == "emu" || sub == "cardemu") {
    String action = lowerCopy(nextToken(rest));
    String assigned_uid;
    if (action.startsWith("uid=")) {
      assigned_uid = action.substring(4);
      rest.trim();
      if (rest.length() > 0) {
        assigned_uid += ' ';
        assigned_uid += rest;
      }
      action = "uid";
    }
    if (action.length() == 0 || action == "status") {
      console_->print(F("hf card role="));
      console_->print(hfRoleName(config_.hfRole));
      console_->print(F(" ready="));
      console_->print(hfReady_ ? F("yes") : F("no"));
      console_->print(F(" uid="));
      console_->print(config_.hfCardUid);
      console_->print(F(" active="));
      console_->print(hfCardEmulationActive_ ? F("yes") : F("no"));
      console_->print(F(" state="));
      console_->print(hfLmStateName(hfLastLmState_));
      console_->print(F(" type=nfc-a-t4t ndef="));
      console_->print(hfCardPayloadTypeName(config_.hfCardPayloadType));
      if (config_.hfCardPayloadType == NetworkRfidHfCardPayloadType::Wifi) {
        console_->print(F(" ssid=\""));
        console_->print(config_.hfCardWifiSsid);
      } else {
        console_->print(F(" payload=\""));
        console_->print(config_.hfCardPayload);
      }
      console_->println(F("\""));
      return;
    }
    if (action == "on" || action == "start") {
      rest.trim();
      if (rest.length() > 0) {
        size_t uid_len = 0;
        uint8_t uid[RFAL_NFCID1_TRIPLE_LEN] = {};
        if (!parseHexBytes(rest, uid, sizeof(uid), uid_len) ||
            (uid_len != 4 && uid_len != 7)) {
          console_->println(F("ERR hf card on [4|7-byte-uid-hex]"));
          return;
        }
        config_.hfCardUid = hexBytes(uid, uid_len, true);
      }
      config_.hfRole = NetworkRfidHfRole::CardEmulation;
      config_.autoInitHf = true;
      if (!hfReady_) {
        hfReady_ = setupHf();
      }
      restartHfRole();
      console_->println(hfCardEmulationActive_ ? F("OK hf card emulation on") : F("ERR hf card emulation unavailable"));
      return;
    }
    if (action == "off" || action == "stop") {
      stopHfCardEmulation();
      config_.hfRole = NetworkRfidHfRole::Scan;
      restartHfRole();
      console_->println(F("OK hf card emulation off"));
      return;
    }
    if (action == "uid") {
      String uid_text = assigned_uid.length() > 0 ? assigned_uid : rest;
      uid_text.trim();
      String lower_uid = lowerCopy(uid_text);
      int cut_pos = -1;
      const char* markers[] = {" active=", " state=", " type=", " ndef=", " payload=", " ssid="};
      for (size_t i = 0; i < (sizeof(markers) / sizeof(markers[0])); ++i) {
        const int marker_pos = lower_uid.indexOf(markers[i]);
        if (marker_pos >= 0 && (cut_pos < 0 || marker_pos < cut_pos)) {
          cut_pos = marker_pos;
        }
      }
      if (cut_pos >= 0) {
        uid_text = uid_text.substring(0, cut_pos);
        uid_text.trim();
      }
      size_t uid_len = 0;
      uint8_t uid[RFAL_NFCID1_TRIPLE_LEN] = {};
      if (!parseHexBytes(uid_text, uid, sizeof(uid), uid_len) ||
          (uid_len != 4 && uid_len != 7)) {
        console_->println(F("ERR hf card uid <4|7-byte-uid-hex>"));
        return;
      }
      config_.hfCardUid = hexBytes(uid, uid_len, true);
      config_.hfRole = NetworkRfidHfRole::CardEmulation;
      config_.autoInitHf = true;
      if (!hfReady_) {
        hfReady_ = setupHf();
      }
      restartHfRole();
      console_->print(F("OK hf card uid="));
      console_->print(config_.hfCardUid);
      console_->print(F(" active="));
      console_->println(hfCardEmulationActive_ ? F("yes") : F("no"));
      return;
    }
    if (action == "ndef" || action == "payload") {
      const String type = lowerCopy(nextToken(rest));
      rest.trim();
      if (type == "url") {
        config_.hfCardPayloadType = NetworkRfidHfCardPayloadType::Url;
        config_.hfCardPayload = rest.length() > 0 ? rest : String(F("https://www.elechouse.com/"));
        limitString(config_.hfCardPayload, kMaxHfCardPayloadLen);
      } else if (type == "text") {
        config_.hfCardPayloadType = NetworkRfidHfCardPayloadType::Text;
        config_.hfCardPayload = rest;
        limitString(config_.hfCardPayload, kMaxHfCardPayloadLen);
      } else if (type == "vcard") {
        config_.hfCardPayloadType = NetworkRfidHfCardPayloadType::Vcard;
        config_.hfCardPayload = rest;
        limitString(config_.hfCardPayload, kMaxHfCardPayloadLen);
      } else if (type == "wifi") {
        config_.hfCardPayloadType = NetworkRfidHfCardPayloadType::Wifi;
        config_.hfCardWifiSsid = nextToken(rest);
        config_.hfCardWifiPassword = rest;
        limitString(config_.hfCardWifiSsid, kMaxHfCardWifiSsidLen);
        limitString(config_.hfCardWifiPassword, kMaxHfCardWifiPasswordLen);
      } else {
        console_->println(F("ERR hf card ndef url|text|vcard|wifi <payload>"));
        return;
      }
      console_->print(F("OK hf card ndef="));
      console_->println(hfCardPayloadTypeName(config_.hfCardPayloadType));
      return;
    }
    console_->println(F("ERR hf card on [uid]|off|uid <hex>|uid=<hex>|ndef url|text|vcard|wifi <payload>|status"));
    return;
  }

  if (sub == "p2p" || sub == "peer") {
    console_->println(F("ERR hf p2p disabled"));
    return;
  }

  if (sub == "bus") {
    console_->println(F("HF bus is fixed by board profile: i2c"));
    return;
  }

  if (sub == "speed") {
    const uint32_t hz = nextToken(rest).toInt();
    if (config_.pins.hfBusMode == NetworkRfidHfBusMode::I2c) {
      if (hz < 10000UL || hz > 1000000UL) {
        console_->println(F("ERR hf speed <10000..1000000> for I2C"));
        return;
      }
      config_.hfI2cHz = hz;
    } else {
      if (hz < 100000UL || hz > 10000000UL) {
        console_->println(F("ERR hf speed <100000..10000000> for SPI"));
        return;
      }
      config_.hfSpiHz = hz;
    }
    console_->println(F("OK hf speed updated"));
    return;
  }

  if (sub == "init" || sub == "start") {
    config_.autoInitHf = true;
    console_->println(F("HF init starting"));
    hfReady_ = setupHf();
    if (hfReady_ && !isLfEnabled()) {
      setActiveSlot(NetworkRfidSlot::HF);
    } else if (hfReady_ && activeSlot_ == NetworkRfidSlot::HF) {
      restartHfRole();
    }
    console_->println(hfReady_ ? F("HF init OK") : F("HF init failed"));
    return;
  }

  if (sub == "off" || sub == "stop") {
    config_.autoInitHf = false;
    releaseHf();
    if (isLfEnabled()) {
      setActiveSlot(NetworkRfidSlot::LF);
    }
    console_->println(F("HF stopped"));
    return;
  }

  console_->println(F("ERR hf probe|speed|mode|scan|tech|card|init|off|status"));
}

void NetworkRfidReader::handleWifiCommand(String rest) {
  const String first = nextToken(rest);
  const String action = lowerCopy(first);

  if (first.length() == 0 || action == "status") {
    const wl_status_t status = WiFi.status();
    console_->print(F("wifi ssid="));
    console_->print(config_.wifiSsid);
    console_->print(F(" passLen="));
    console_->print(config_.wifiPassword.length());
    console_->print(F(" hostname="));
    console_->print(NETWORK_RFID_WIFI_HOSTNAME);
    console_->print(F(" status="));
    console_->print(wifiStatusName(status));
    console_->print(F("("));
    console_->print(static_cast<int>(status));
    console_->print(F(")"));
    if (status == WL_CONNECTED) {
      console_->print(F(" ip="));
      console_->print(WiFi.localIP());
      console_->print(F(" rssi="));
      console_->print(WiFi.RSSI());
      console_->print(F(" bssid="));
      console_->print(WiFi.BSSIDstr());
    }
    if (lastWifiDisconnectReason_ != 0) {
      console_->print(F(" lastReason="));
      console_->print(lastWifiDisconnectReason_);
      console_->print(F(":"));
      console_->print(WiFi.disconnectReasonName(static_cast<wifi_err_reason_t>(lastWifiDisconnectReason_)));
      console_->print(F(" ageMs="));
      console_->print(millis() - lastWifiDisconnectMs_);
    }
    console_->println();
    return;
  }

  if (action == "off" || action == "clear") {
    config_.wifiSsid = "";
    config_.wifiPassword = "";
    wifiConnectInProgress_ = false;
    restartTcpSocket();
    WiFi.disconnect(false, true);
    console_->println(F("OK wifi cleared"));
    return;
  }

