wilson-elechouse/network_RFID/ESP32S3_LF_HF_Network_RFID/src/NetworkRfidReader.cpp
  if (sub == "commands" || sub == "cmd") {
    const String value = lowerCopy(nextToken(rest));
    if (value != "on" && value != "off") {
      console_->println(F("ERR uart commands on|off"));
      return;
    }
    config_.hardwareUartCommands = value == "on";
    console_->println(F("OK uart commands updated"));
    return;
  }

  console_->println(F("ERR uart status|on [baud]|off|baud <baud>|echo on|off|commands on|off"));
}

void NetworkRfidReader::handleInterfaceCommand(String rest) {
  const String sub = lowerCopy(nextToken(rest));
  if (sub.length() == 0 || sub == "status") {
    console_->print(F("interface mode="));
    console_->print(productInterfaceModeName(config_.productInterfaceMode));
    console_->print(F(" enabled="));
    console_->print(config_.hardwareUartEnabled ? F("yes") : F("no"));
    console_->print(F(" uartReady="));
    console_->print(hardwareUartReady_ ? F("yes") : F("no"));
    console_->print(F(" pulseReady="));
    console_->print(productInterfacePulseReady_ ? F("yes") : F("no"));
    console_->print(F(" d0Clock="));
    console_->print(config_.pins.hardwareUartRx);
    console_->print(F(" d1Data="));
    console_->print(config_.pins.hardwareUartTx);
    console_->print(F(" events="));
    console_->print(config_.hardwareUartEchoEvents ? F("on") : F("off"));
    console_->print(F(" commands="));
    console_->print(config_.hardwareUartCommands ? F("on") : F("off"));
    console_->print(F(" baud="));
    console_->print(config_.hardwareUartBaud);
    console_->print(F(" wiegandBits="));
    console_->print(config_.wiegandBits);
    console_->print(F(" pulseUs="));
    console_->print(config_.productPulseUs);
    console_->print(F(" gapUs="));
    console_->print(config_.productPulseGapUs);
    console_->print(F(" abaDigits="));
    if (config_.abaDigits == 0) {
      console_->print(F("auto"));
    } else {
      console_->print(config_.abaDigits);
    }
    console_->print(F(" abaSource="));
    console_->println(config_.abaUseCardNumber ? F("cn") : F("raw"));
    return;
  }

  if (sub == "pins" || sub == "pin") {
    console_->print(F("Product interface pins are fixed by board profile: UART RX/D0/Clock GPIO"));
    console_->print(config_.pins.hardwareUartRx);
    console_->print(F(" UART TX/D1/Data GPIO"));
    console_->println(config_.pins.hardwareUartTx);
    return;
  }

  if (sub == "mode") {
    const String value = lowerCopy(nextToken(rest));
    NetworkRfidProductInterfaceMode mode = config_.productInterfaceMode;
    if (value == "uart" || value == "serial" || value == "serial1") {
      mode = NetworkRfidProductInterfaceMode::Uart;
    } else if (value == "wiegand" || value == "wg") {
      mode = NetworkRfidProductInterfaceMode::Wiegand;
    } else if (value == "aba" || value == "clockdata" || value == "clock-data") {
      mode = NetworkRfidProductInterfaceMode::Aba;
    } else {
      console_->println(F("ERR interface mode uart|wiegand|aba"));
      return;
    }

    config_.productInterfaceMode = mode;
    config_.hardwareUartEnabled = true;
    const bool command_from_uart = console_ == &hardwareUart_;
    if (command_from_uart) {
      console_->print(F("OK interface mode="));
      console_->println(productInterfaceModeName(config_.productInterfaceMode));
      console_->flush();
      delay(20);
    }
    restartProductInterface();
    if (!command_from_uart) {
      console_->print(F("OK interface mode="));
      console_->println(productInterfaceModeName(config_.productInterfaceMode));
    }
    return;
  }

  if (sub == "on" || sub == "start") {
    config_.hardwareUartEnabled = true;
    const bool command_from_uart = console_ == &hardwareUart_;
    if (command_from_uart) {
      console_->println(F("OK interface on"));
      console_->flush();
      delay(20);
    }
    restartProductInterface();
    if (!command_from_uart) {
      console_->println(F("OK interface on"));
    }
    return;
  }

  if (sub == "off" || sub == "stop") {
    config_.hardwareUartEnabled = false;
    console_->println(F("OK interface off"));
    if (console_ == &hardwareUart_) {
      console_->flush();
      delay(20);
    }
    restartProductInterface();
    return;
  }

  if (sub == "events" || sub == "echo") {
    const String value = lowerCopy(nextToken(rest));
    if (value != "on" && value != "off") {
      console_->println(F("ERR interface events on|off"));
      return;
    }
    config_.hardwareUartEchoEvents = value == "on";
    console_->println(F("OK interface events updated"));
    return;
  }

  if (sub == "commands" || sub == "cmd") {
    const String value = lowerCopy(nextToken(rest));
    if (value != "on" && value != "off") {
      console_->println(F("ERR interface commands on|off"));
      return;
    }
    config_.hardwareUartCommands = value == "on";
    console_->println(F("OK interface commands updated"));
    return;
  }

  if (sub == "baud" || sub == "speed") {
    const uint32_t baud = nextToken(rest).toInt();
    if (baud < 1200UL || baud > 3000000UL) {
      console_->println(F("ERR interface baud 1200..3000000"));
      return;
    }
    config_.hardwareUartBaud = baud;
    config_.productInterfaceMode = NetworkRfidProductInterfaceMode::Uart;
    const bool command_from_uart = console_ == &hardwareUart_;
    if (command_from_uart) {
      console_->print(F("OK interface baud="));
      console_->println(config_.hardwareUartBaud);
      console_->flush();
      delay(20);
    }
    restartProductInterface();
    if (!command_from_uart) {
      console_->print(F("OK interface baud="));
      console_->println(config_.hardwareUartBaud);
    }
    return;
  }

  if (sub == "pulse") {
    const uint32_t pulse = nextToken(rest).toInt();
    const uint32_t gap = nextToken(rest).toInt();
    if (pulse < kMinProductPulseUs || pulse > kMaxProductPulseUs ||
        gap < kMinProductPulseGapUs || gap > kMaxProductPulseGapUs) {
      console_->print(F("ERR interface pulse <"));
      console_->print(kMinProductPulseUs);
      console_->print(F(".."));
      console_->print(kMaxProductPulseUs);
      console_->print(F("_us> <"));
      console_->print(kMinProductPulseGapUs);
      console_->print(F(".."));
      console_->print(kMaxProductPulseGapUs);
      console_->println(F("_us>"));
      return;
    }
    config_.productPulseUs = static_cast<uint16_t>(pulse);
    config_.productPulseGapUs = static_cast<uint16_t>(gap);
    console_->println(F("OK interface pulse updated"));
    return;
  }

