wilson-elechouse/network_RFID/ESP32S3_LF_HF_Network_RFID/src/NetworkRfidReader.cpp
void NetworkRfidReader::handlePinCommand(String rest) {
  const String name = lowerCopy(nextToken(rest));
  const String value = nextToken(rest);
  if (name.length() == 0 || value.length() == 0) {
    printPins();
    return;
  }

  (void)name;
  (void)value;
  console_->println(F("ERR hardware pins are fixed by board profile; edit NetworkRfidBoardProfile.h and rebuild"));
}

void NetworkRfidReader::startConfigPortal() {
  if (!config_.configPortalEnabled || portalRunning_) {
    return;
  }

  WiFi.mode(WiFi.status() == WL_CONNECTED ? WIFI_AP_STA : WIFI_AP);

  IPAddress portal_ip(10, 10, 10, 10);
  IPAddress gateway(10, 10, 10, 10);
  IPAddress subnet(255, 255, 255, 0);
  WiFi.softAPConfig(portal_ip, gateway, subnet);

  String ssid = config_.configPortalSsid.length() > 0 ? config_.configPortalSsid : defaultPortalSsid();
  const bool open_ap = config_.configPortalPassword.length() == 0;
  const char* password = open_ap ? "" : config_.configPortalPassword.c_str();
  const uint8_t ap_channel = 6;
  if (!WiFi.softAP(ssid.c_str(), password, ap_channel, 0, 4)) {
    if (console_ != nullptr) {
      console_->println(F("ERR portal AP start failed"));
    }
    return;
  }

  portalDns_ = new DNSServer();
  portalDns_->setErrorReplyCode(DNSReplyCode::NoError);
  portalDns_->start(53, "*", portal_ip);

  portalServer_ = new WebServer(config_.configPortalPort == 0 ? 80 : config_.configPortalPort);
  portalServer_->on("/", HTTP_GET, [this]() { handlePortalRoot(); });
  portalServer_->on("/save", HTTP_POST, [this]() { handlePortalSave(); });
  portalServer_->on("/reboot", HTTP_POST, [this]() { handlePortalReboot(); });
  portalServer_->onNotFound([this]() { handlePortalNotFound(); });
  portalServer_->begin();

  portalRunning_ = true;
  portalStartMs_ = millis();
  if (console_ != nullptr) {
    console_->print(F("Portal AP ssid="));
    console_->print(ssid);
    console_->print(F(" ip="));
    console_->print(WiFi.softAPIP());
    console_->print(F(" port="));
    console_->print(config_.configPortalPort == 0 ? 80 : config_.configPortalPort);
    console_->println(F(" url=http://10.10.10.10/"));
  }
}

void NetworkRfidReader::stopConfigPortal() {
  if (portalServer_ != nullptr) {
    portalServer_->stop();
    delete portalServer_;
    portalServer_ = nullptr;
  }
  if (portalDns_ != nullptr) {
    portalDns_->stop();
    delete portalDns_;
    portalDns_ = nullptr;
  }
  if (portalRunning_) {
    WiFi.softAPdisconnect(false);
    portalRunning_ = false;
    portalStartMs_ = 0;
  }
}

void NetworkRfidReader::serviceConfigPortal() {
  if (!config_.configPortalEnabled && portalRunning_) {
    stopConfigPortal();
    if (config_.wifiSsid.length() > 0) {
      startWifi();
    }
    return;
  }

  if (portalRunning_ && portalStartMs_ != 0 && (millis() - portalStartMs_) >= kPortalAutoRebootMs) {
    if (console_ != nullptr) {
      console_->println(F("Portal timeout, rebooting"));
    }
    delay(100);
    ESP.restart();
  }

  if (portalDns_ != nullptr) {
    portalDns_->processNextRequest();
  }
  if (portalServer_ != nullptr) {
    portalServer_->handleClient();
  }
}

void NetworkRfidReader::handlePortalRoot() {
  sendPortalPage("");
}

void NetworkRfidReader::handlePortalSave() {
  if (portalServer_ == nullptr) {
    return;
  }

  const String new_portal_password = portalServer_->arg("portal_password");
  if (new_portal_password.length() > 0 && new_portal_password.length() < 8) {
    sendPortalPage("AP password must be empty or at least 8 characters.");
    return;
  }
  const NetworkRfidHfRole old_hf_role = config_.hfRole;
  const bool old_auto_lf = config_.autoStartLf;
  const bool old_auto_hf = config_.autoInitHf;
  const NetworkRfidProductInterfaceMode old_iface_mode = config_.productInterfaceMode;
  const bool old_iface_enabled = config_.hardwareUartEnabled;
  const bool old_iface_events = config_.hardwareUartEchoEvents;
  const bool old_iface_commands = config_.hardwareUartCommands;
  const uint32_t old_uart_baud = config_.hardwareUartBaud;
  const uint8_t old_wiegand_bits = config_.wiegandBits;
  const uint16_t old_pulse_us = config_.productPulseUs;
  const uint16_t old_pulse_gap_us = config_.productPulseGapUs;
  const uint8_t old_aba_digits = config_.abaDigits;
  const bool old_aba_source_cn = config_.abaUseCardNumber;
  const bool old_feedback_enabled = config_.feedbackEnabled;
  const bool old_button_enabled = config_.configButtonEnabled;

  NetworkRfidTcpMode new_tcp_mode = NetworkRfidTcpMode::Off;
  const String mode = lowerCopy(portalServer_->arg("tcp_mode"));
  if (mode == "client") {
    new_tcp_mode = NetworkRfidTcpMode::Client;
  } else if (mode == "server") {
    new_tcp_mode = NetworkRfidTcpMode::Server;
  } else if (mode == "elechouse") {
    new_tcp_mode = NetworkRfidTcpMode::ElechouseTest;
  }

  const uint16_t new_portal_port = parsePortForm(portalServer_, "portal_port", config_.configPortalPort == 0 ? 80 : config_.configPortalPort);
  const uint16_t new_tcp_listen = parsePortForm(portalServer_, "tcp_listen_port", config_.tcpListenPort);
  if (new_tcp_mode == NetworkRfidTcpMode::Server &&
      new_tcp_listen == new_portal_port) {
    sendPortalPage("TCP server port conflicts with portal port.");
    return;
  }

  String new_elechouse_code = portalServer_->arg("elechouse_code");
  new_elechouse_code.trim();
  if (new_tcp_mode == NetworkRfidTcpMode::ElechouseTest) {
    if (!isValidElechouseSessionCode(new_elechouse_code)) {
      sendPortalPage("ELECHOUSE session code is required. Allowed: A-Z a-z 0-9 _ . : -");
      return;
    }
  } else if (new_elechouse_code.length() > 0 &&
             !isValidElechouseSessionCode(new_elechouse_code)) {
    sendPortalPage("ELECHOUSE session code contains invalid characters.");
    return;
  }

  config_.wifiSsid = portalServer_->arg("wifi_ssid");
  config_.wifiPassword = portalServer_->arg("wifi_password");
  config_.tcpMode = new_tcp_mode;

  if (new_tcp_mode == NetworkRfidTcpMode::Client) {
    config_.tcpHost = portalServer_->arg("tcp_host");
    config_.tcpPort = parsePortForm(portalServer_, "tcp_port", config_.tcpPort);
  } else if (new_tcp_mode == NetworkRfidTcpMode::Server) {
    config_.tcpListenPort = new_tcp_listen;
  } else if (new_tcp_mode == NetworkRfidTcpMode::ElechouseTest) {
    config_.elechouseSessionCode = new_elechouse_code;
  } else if (new_elechouse_code.length() > 0) {
    config_.elechouseSessionCode = new_elechouse_code;
  }

  if (config_.tcpMode == NetworkRfidTcpMode::ElechouseTest) {
    config_.tcpEchoEvents = true;
    config_.tcpCommands = true;
  } else if (config_.tcpMode != NetworkRfidTcpMode::Off) {
    config_.tcpEchoEvents = parseBoolForm(portalServer_, "tcp_echo");
    config_.tcpCommands = parseBoolForm(portalServer_, "tcp_commands");
  }

