wilson-elechouse/network_RFID/ESP32S3_LF_HF_Network_RFID/src/NetworkRfidReader.cpp
  const String iface_mode = lowerCopy(portalServer_->arg("iface_mode"));
  if (iface_mode == "wiegand") {
    config_.productInterfaceMode = NetworkRfidProductInterfaceMode::Wiegand;
  } else if (iface_mode == "aba") {
    config_.productInterfaceMode = NetworkRfidProductInterfaceMode::Aba;
  } else {
    config_.productInterfaceMode = NetworkRfidProductInterfaceMode::Uart;
  }
  config_.hardwareUartEnabled = parseBoolForm(portalServer_, "uart_enabled");
  config_.hardwareUartEchoEvents = parseBoolForm(portalServer_, "uart_echo");
  if (config_.productInterfaceMode == NetworkRfidProductInterfaceMode::Uart) {
    config_.hardwareUartCommands = parseBoolForm(portalServer_, "uart_commands");
    config_.hardwareUartBaud = parseUIntForm(portalServer_, "uart_baud", config_.hardwareUartBaud);
    if (config_.hardwareUartBaud < 1200UL) {
      config_.hardwareUartBaud = 1200UL;
    } else if (config_.hardwareUartBaud > 3000000UL) {
      config_.hardwareUartBaud = 3000000UL;
    }
  } else if (config_.productInterfaceMode == NetworkRfidProductInterfaceMode::Wiegand) {
    config_.wiegandBits = static_cast<uint8_t>(parseUIntForm(portalServer_, "wiegand_bits", config_.wiegandBits));
    if (!isSupportedWiegandBits(config_.wiegandBits)) {
      config_.wiegandBits = 34;
    }
    config_.productPulseUs = static_cast<uint16_t>(parseUIntForm(portalServer_, "pulse_us", config_.productPulseUs));
    config_.productPulseGapUs = static_cast<uint16_t>(parseUIntForm(portalServer_, "pulse_gap_us", config_.productPulseGapUs));
  } else {
    config_.productPulseUs = static_cast<uint16_t>(parseUIntForm(portalServer_, "pulse_us", config_.productPulseUs));
    config_.productPulseGapUs = static_cast<uint16_t>(parseUIntForm(portalServer_, "pulse_gap_us", config_.productPulseGapUs));
    config_.abaDigits = static_cast<uint8_t>(parseUIntForm(portalServer_, "aba_digits", config_.abaDigits));
    if (config_.abaDigits > 32) {
      config_.abaDigits = 32;
    }
    config_.abaUseCardNumber = lowerCopy(portalServer_->arg("aba_source")) == "cn";
  }
  if (config_.productPulseUs < kMinProductPulseUs) {
    config_.productPulseUs = kMinProductPulseUs;
  } else if (config_.productPulseUs > kMaxProductPulseUs) {
    config_.productPulseUs = kMaxProductPulseUs;
  }
  if (config_.productPulseGapUs < kMinProductPulseGapUs) {
    config_.productPulseGapUs = kMinProductPulseGapUs;
  } else if (config_.productPulseGapUs > kMaxProductPulseGapUs) {
    config_.productPulseGapUs = kMaxProductPulseGapUs;
  }

  config_.autoStartLf = parseBoolForm(portalServer_, "auto_lf");
  config_.autoInitHf = parseBoolForm(portalServer_, "auto_hf");
  config_.echoEventsToSerial = parseBoolForm(portalServer_, "echo_serial");
  config_.feedbackEnabled = parseBoolForm(portalServer_, "feedback_enabled");
  config_.configButtonEnabled = parseBoolForm(portalServer_, "button_enabled");

  const String hf_role = lowerCopy(portalServer_->arg("hf_role"));
  if (hf_role == "card") {
    config_.hfRole = NetworkRfidHfRole::CardEmulation;
  } else if (hf_role == "p2p") {
    sendPortalPage("HF P2P is disabled in this firmware.");
    return;
  } else {
    config_.hfRole = NetworkRfidHfRole::Scan;
  }

  if (config_.hfRole == NetworkRfidHfRole::CardEmulation) {
    String hf_card_uid = portalServer_->arg("hf_card_uid");
    hf_card_uid.trim();
    if (hf_card_uid.length() > 0) {
      uint8_t uid[RFAL_NFCID1_TRIPLE_LEN] = {};
      size_t uid_len = 0;
      if (!parseHexBytes(hf_card_uid, uid, sizeof(uid), uid_len) ||
          (uid_len != 4 && uid_len != 7 && uid_len != 10)) {
        sendPortalPage("HF card UID must be 4, 7, or 10 hex bytes.");
        return;
      }
      config_.hfCardUid = hexBytes(uid, uid_len, true);
    }

    const String ndef_type = lowerCopy(portalServer_->arg("hf_ndef_type"));
    if (ndef_type == "text") {
      config_.hfCardPayloadType = NetworkRfidHfCardPayloadType::Text;
    } else if (ndef_type == "vcard") {
      config_.hfCardPayloadType = NetworkRfidHfCardPayloadType::Vcard;
    } else if (ndef_type == "wifi") {
      config_.hfCardPayloadType = NetworkRfidHfCardPayloadType::Wifi;
    } else {
      config_.hfCardPayloadType = NetworkRfidHfCardPayloadType::Url;
    }

    if (config_.hfCardPayloadType == NetworkRfidHfCardPayloadType::Wifi) {
      config_.hfCardWifiSsid = portalServer_->arg("hf_ndef_wifi_ssid");
      config_.hfCardWifiPassword = portalServer_->arg("hf_ndef_wifi_password");
      limitString(config_.hfCardWifiSsid, kMaxHfCardWifiSsidLen);
      limitString(config_.hfCardWifiPassword, kMaxHfCardWifiPasswordLen);
    } else {
      config_.hfCardPayload = portalServer_->arg("hf_ndef_payload");
      config_.hfCardPayload.trim();
      if (config_.hfCardPayload.length() == 0 &&
          config_.hfCardPayloadType == NetworkRfidHfCardPayloadType::Url) {
        config_.hfCardPayload = F("https://www.elechouse.com/");
      }
      limitString(config_.hfCardPayload, kMaxHfCardPayloadLen);
    }
  }

  if (config_.hfRole == NetworkRfidHfRole::Scan) {
    uint16_t hf_techs = 0;
    if (parseBoolForm(portalServer_, "hf_tech_a")) {
      hf_techs |= RFAL_NFC_POLL_TECH_A;
    }
    if (parseBoolForm(portalServer_, "hf_tech_b")) {
      hf_techs |= RFAL_NFC_POLL_TECH_B;
    }
    if (parseBoolForm(portalServer_, "hf_tech_f")) {
      hf_techs |= RFAL_NFC_POLL_TECH_F;
    }
    if (parseBoolForm(portalServer_, "hf_tech_v")) {
      hf_techs |= RFAL_NFC_POLL_TECH_V;
    }
    config_.hfTechs = hf_techs == 0 ? RFAL_NFC_POLL_TECH_A : hf_techs;
  }

  config_.configPortalEnabled = true;
  config_.configPortalSsid = portalServer_->arg("portal_ssid");
  config_.configPortalPassword = new_portal_password;
  config_.configPortalPort = new_portal_port == 0 ? 80 : new_portal_port;

  const bool saved = saveConfig();
  restartStation();
  restartTcpSocket();
  if (old_iface_mode != config_.productInterfaceMode ||
      old_iface_enabled != config_.hardwareUartEnabled ||
      old_iface_events != config_.hardwareUartEchoEvents ||
      old_iface_commands != config_.hardwareUartCommands ||
      old_uart_baud != config_.hardwareUartBaud ||
      old_wiegand_bits != config_.wiegandBits ||
      old_pulse_us != config_.productPulseUs ||
      old_pulse_gap_us != config_.productPulseGapUs ||
      old_aba_digits != config_.abaDigits ||
      old_aba_source_cn != config_.abaUseCardNumber) {
    restartProductInterface();
  }
  if (old_feedback_enabled != config_.feedbackEnabled) {
    setupFeedback();
  }
  if (old_button_enabled != config_.configButtonEnabled) {
    setupButton();
  }

  const bool hf_role_changed = old_hf_role != config_.hfRole;
  const bool auto_lf_changed = old_auto_lf != config_.autoStartLf;
  const bool auto_hf_changed = old_auto_hf != config_.autoInitHf;
  if (!config_.autoInitHf && hfReady_) {
    releaseHf();
  } else if (config_.autoInitHf && !hfReady_) {
    hfReady_ = setupHf();
  } else if (hfReady_) {
    stopHfDiscovery();
    if (hf_role_changed) {
      stopHfCardEmulation();
    }
  }

  if (auto_lf_changed || auto_hf_changed) {
    if (config_.autoStartLf) {
      setActiveSlot(NetworkRfidSlot::LF);
    } else {
      setLfCapture(false);
      setLfCarrier(false);
      if (isHfEnabled()) {
        setActiveSlot(NetworkRfidSlot::HF);
      }
    }
  }

  if (!saved) {
    sendPortalPage("Save failed.");
    return;
  }

  sendPortalPage("Saved. Rebooting...");
  delay(800);
  ESP.restart();
}

void NetworkRfidReader::handlePortalReboot() {
  if (portalServer_ != nullptr) {
    portalServer_->send(200, "text/plain", "Rebooting\n");
  }
  delay(200);
  ESP.restart();
}

void NetworkRfidReader::handlePortalNotFound() {
  if (portalServer_ == nullptr) {
    return;
  }
  portalServer_->sendHeader("Location", "http://10.10.10.10/", true);
  portalServer_->send(302, "text/plain", "");
}

void NetworkRfidReader::sendPortalPage(const String& message) {
  if (portalServer_ == nullptr) {
    return;
  }

  const bool tcp_off = config_.tcpMode == NetworkRfidTcpMode::Off;
  const bool tcp_client = config_.tcpMode == NetworkRfidTcpMode::Client;
  const bool tcp_server = config_.tcpMode == NetworkRfidTcpMode::Server;
  const bool tcp_elechouse = config_.tcpMode == NetworkRfidTcpMode::ElechouseTest;
  const bool iface_uart = config_.productInterfaceMode == NetworkRfidProductInterfaceMode::Uart;
  const bool iface_wiegand = config_.productInterfaceMode == NetworkRfidProductInterfaceMode::Wiegand;
  const bool iface_aba = config_.productInterfaceMode == NetworkRfidProductInterfaceMode::Aba;
  const bool hf_role_scan = config_.hfRole == NetworkRfidHfRole::Scan;
  const bool hf_role_card = config_.hfRole == NetworkRfidHfRole::CardEmulation;
  const bool ndef_url = config_.hfCardPayloadType == NetworkRfidHfCardPayloadType::Url;
  const bool ndef_text = config_.hfCardPayloadType == NetworkRfidHfCardPayloadType::Text;
  const bool ndef_vcard = config_.hfCardPayloadType == NetworkRfidHfCardPayloadType::Vcard;
  const bool ndef_wifi = config_.hfCardPayloadType == NetworkRfidHfCardPayloadType::Wifi;
  const String ap_ssid = config_.configPortalSsid.length() > 0 ? config_.configPortalSsid : defaultPortalSsid();

  String page;
  page.reserve(25000);
  page += F("<!doctype html><html><head><meta charset='utf-8'>");
  page += F("<meta name='viewport' content='width=device-width,initial-scale=1'>");
  page += F("<title>RFID Reader Config</title><style>");
  page += F("body{font-family:Arial,sans-serif;margin:0;background:#f6f7f9;color:#17202a}");
  page += F("main{max-width:760px;margin:0 auto;padding:18px}h1{font-size:24px;margin:0 0 14px}");
  page += F("section{background:#fff;border:1px solid #d9dee7;border-radius:8px;margin:12px 0;padding:14px}");
  page += F("h2{font-size:16px;margin:0 0 10px}.row{display:grid;grid-template-columns:170px 1fr;gap:8px;align-items:center;margin:8px 0}");
  page += F("input,select,textarea{box-sizing:border-box;width:100%;padding:8px;border:1px solid #c9d0da;border-radius:6px;font-size:15px}textarea{min-height:86px;resize:vertical}");
  page += F(".checks label{display:inline-flex;gap:6px;align-items:center;margin:4px 14px 4px 0}.checks input{width:auto}");
  page += F(".msg{padding:9px 10px;background:#eaf4ff;border:1px solid #b8dafb;border-radius:6px;margin:10px 0}");
  page += F(".note{font-size:13px;color:#566273;margin:8px 0;line-height:1.45}.kv{display:grid;grid-template-columns:170px 1fr;gap:8px;margin:6px 0;font-size:14px}");
  page += F(".actions{display:flex;gap:10px;flex-wrap:wrap}button{padding:9px 14px;border:0;border-radius:6px;background:#165dff;color:white;font-size:15px}");
  page += F("button.secondary{background:#4d5968}[hidden]{display:none!important}@media(max-width:620px){.row,.kv{grid-template-columns:1fr}}</style>");
  page += F("<script>function v(n){var s=document.querySelector('[name='+n+']');return s?s.value:'';}function m(e,a,x){var r=e.getAttribute(a);return !r||r.split(',').indexOf(x)>=0;}function syncAll(){var t=v('tcp_mode'),i=v('iface_mode'),h=v('hf_role'),n=v('hf_ndef_type');document.querySelectorAll('[data-tcp],[data-iface],[data-hfrole],[data-ndef]').forEach(function(e){var show=m(e,'data-tcp',t)&&m(e,'data-iface',i)&&m(e,'data-hfrole',h)&&m(e,'data-ndef',n);e.hidden=!show;e.querySelectorAll('input,select,textarea').forEach(function(x){x.disabled=!show;});});}document.addEventListener('DOMContentLoaded',function(){['tcp_mode','iface_mode','hf_role','hf_ndef_type'].forEach(function(n){var s=document.querySelector('[name='+n+']');if(s)s.addEventListener('change',syncAll);});syncAll();});</script>");
  page += F("</head><body><main>");
  page += F("<h1>RFID Reader Config</h1>");
  if (message.length() > 0) {
    page += F("<div class='msg'>");
    page += htmlEscape(message);
    page += F("</div>");
  }
  page += F("<section><h2>Status</h2>");
  page += F("<div>AP IP: 10.10.10.10</div><div>Portal URL: http://10.10.10.10/</div><div>STA IP: ");
  page += htmlEscape(WiFi.status() == WL_CONNECTED ? WiFi.localIP().toString() : String(F("disconnected")));
  page += F("</div><div>TCP: ");
  page += tcpModeName(config_.tcpMode);
  page += F("</div></section>");

  page += F("<form method='post' action='/save'>");
  page += F("<section><h2>WiFi</h2>");
  page += F("<div class='row'><label>SSID</label><input name='wifi_ssid' value='");
  page += htmlEscape(config_.wifiSsid);
  page += F("'></div><div class='row'><label>Password</label><input name='wifi_password' type='password' value='");
  page += htmlEscape(config_.wifiPassword);
  page += F("'></div></section>");

  page += F("<section><h2>TCP Socket</h2>");
  page += F("<div class='row'><label>Mode</label><select name='tcp_mode'>");
  page += F("<option value='off'");
  page += tcp_off ? F(" selected") : F("");
  page += F(">Off</option><option value='client'");
  page += tcp_client ? F(" selected") : F("");
  page += F(">Client</option><option value='server'");
  page += tcp_server ? F(" selected") : F("");
  page += F(">Server</option><option value='elechouse'");
  page += tcp_elechouse ? F(" selected") : F("");
  page += F(">ELECHOUSE Test</option></select></div>");
  page += F("<div class='row' data-tcp='elechouse'><label>ELECHOUSE code</label><input name='elechouse_code' maxlength='64' value='");
  page += htmlEscape(config_.elechouseSessionCode);
  page += F("'></div>");
  page += F("<div class='note' data-tcp='elechouse'>ELECHOUSE Test uses fixed target www.elechouse.com:9000. TCP events and commands are enabled automatically.</div>");
  page += F("<div class='row' data-tcp='client'><label>Client host</label><input name='tcp_host' value='");
  page += htmlEscape(config_.tcpHost);
  page += F("'></div><div class='row' data-tcp='client'><label>Client port</label><input name='tcp_port' type='number' min='1' max='65535' value='");
  page += String(config_.tcpPort);
  page += F("'></div><div class='row' data-tcp='server'><label>Server port</label><input name='tcp_listen_port' type='number' min='1' max='65535' value='");
  page += String(config_.tcpListenPort);
  page += F("'></div><div class='checks' data-tcp='client,server'><label><input type='checkbox' name='tcp_echo'");
  page += config_.tcpEchoEvents ? F(" checked") : F("");
  page += F(">TCP events</label><label><input type='checkbox' name='tcp_commands'");
  page += config_.tcpCommands ? F(" checked") : F("");
  page += F(">TCP commands</label></div></section>");

  page += F("<section><h2>Product Interface</h2>");
  page += F("<div>Fixed pins: RX/D0/Clock GPIO");
  page += String(config_.pins.hardwareUartRx);
  page += F(", TX/D1/Data GPIO");
  page += String(config_.pins.hardwareUartTx);
  page += F("</div>");
  page += F("<div class='row'><label>Mode</label><select name='iface_mode'><option value='uart'");
  page += iface_uart ? F(" selected") : F("");
  page += F(">UART</option><option value='wiegand'");
  page += iface_wiegand ? F(" selected") : F("");
  page += F(">Wiegand D0/D1</option><option value='aba'");
  page += iface_aba ? F(" selected") : F("");
  page += F(">ABA Clock/Data</option></select></div>");
  page += F("<div class='row' data-iface='uart'><label>UART baud</label><input name='uart_baud' type='number' min='1200' max='3000000' value='");
  page += String(config_.hardwareUartBaud);
  page += F("'></div><div class='row' data-iface='wiegand'><label>Wiegand bits</label><select name='wiegand_bits'><option value='26'");
  page += config_.wiegandBits == 26 ? F(" selected") : F("");
  page += F(">26</option><option value='34'");
  page += config_.wiegandBits == 34 ? F(" selected") : F("");
  page += F(">34</option><option value='37'");
  page += config_.wiegandBits == 37 ? F(" selected") : F("");
  page += F(">37</option><option value='56'");
  page += config_.wiegandBits == 56 ? F(" selected") : F("");
  page += F(">56</option></select></div>");
  page += F("<div class='row' data-iface='wiegand,aba'><label>Pulse us</label><input name='pulse_us' type='number' min='20' max='1000' value='");
  page += String(config_.productPulseUs);
  page += F("'></div><div class='row' data-iface='wiegand,aba'><label>Pulse gap us</label><input name='pulse_gap_us' type='number' min='200' max='20000' value='");
  page += String(config_.productPulseGapUs);
  page += F("'></div><div class='row' data-iface='aba'><label>ABA digits</label><input name='aba_digits' type='number' min='0' max='32' value='");
  page += String(config_.abaDigits);
  page += F("'></div><div class='row' data-iface='aba'><label>ABA source</label><select name='aba_source'><option value='raw'");
  page += config_.abaUseCardNumber ? F("") : F(" selected");
  page += F(">Raw</option><option value='cn'");
  page += config_.abaUseCardNumber ? F(" selected") : F("");
  page += F(">CN</option></select></div>");
  page += F("<div class='checks'><label><input type='checkbox' name='uart_enabled'");
  page += config_.hardwareUartEnabled ? F(" checked") : F("");
  page += F(">Interface enabled</label><label><input type='checkbox' name='uart_echo'");
  page += config_.hardwareUartEchoEvents ? F(" checked") : F("");
  page += F(">Interface events</label><label data-iface='uart'><input type='checkbox' name='uart_commands'");
  page += config_.hardwareUartCommands ? F(" checked") : F("");
  page += F(">UART commands</label></div></section>");

  page += F("<section><h2>Reader</h2>");
  page += F("<div class='checks'><label><input type='checkbox' name='auto_lf'");
  page += config_.autoStartLf ? F(" checked") : F("");
  page += F(">LF enabled</label><label><input type='checkbox' name='auto_hf'");
  page += config_.autoInitHf ? F(" checked") : F("");
  page += F(">HF enabled</label><label><input type='checkbox' name='echo_serial'");
  page += config_.echoEventsToSerial ? F(" checked") : F("");
  page += F(">USB serial events</label></div>");
  page += F("<div class='note'>Output format, LF/HF windows, dedupe, and reconnect interval are command-line settings.</div></section>");

  page += F("<section><h2>Feedback and Button</h2>");
  page += F("<div class='checks'><label><input type='checkbox' name='feedback_enabled'");
  page += config_.feedbackEnabled ? F(" checked") : F("");
  page += F(">Feedback enabled</label><label><input type='checkbox' name='button_enabled'");
  page += config_.configButtonEnabled ? F(" checked") : F("");
  page += F(">Button enabled</label></div>");
  page += F("<div class='note'>Buzzer, LED colors, and button timing are command-line settings. Button feedback: 5s one beep, 10s two beeps.</div></section>");

  page += F("<section><h2>HF</h2>");
  page += F("<div class='row'><label>Role</label><select name='hf_role'><option value='scan'");
  page += hf_role_scan ? F(" selected") : F("");
  page += F(">Scan</option><option value='card'");
  page += hf_role_card ? F(" selected") : F("");
  page += F(">Card emulation</option></select></div>");
  page += F("<div>Fixed bus: I2C, SCL GPIO");
  page += String(config_.pins.hfSck);
  page += F(", SDA GPIO");
  page += String(config_.pins.hfMiso);
  page += F(", IRQ GPIO");
  page += String(config_.pins.hfIrq);
  page += F("</div>");
  page += F("<div class='row' data-hfrole='card'><label>Card UID</label><input name='hf_card_uid' value='");
  page += htmlEscape(config_.hfCardUid);
  page += F("'></div>");
  page += F("<div class='kv' data-hfrole='card'><div>Simulated card</div><div>NFC-A Type 4 Tag / NDEF</div></div>");
  page += F("<div class='row' data-hfrole='card'><label>NDEF type</label><select name='hf_ndef_type'><option value='url'");
  page += ndef_url ? F(" selected") : F("");
  page += F(">URL</option><option value='text'");
  page += ndef_text ? F(" selected") : F("");
  page += F(">Text</option><option value='vcard'");
  page += ndef_vcard ? F(" selected") : F("");
  page += F(">vCard</option><option value='wifi'");
  page += ndef_wifi ? F(" selected") : F("");
  page += F(">WiFi</option></select></div>");
  page += F("<div class='row' data-hfrole='card' data-ndef='url'><label>URL</label><input name='hf_ndef_payload' maxlength='512' value='");
  page += htmlEscape(config_.hfCardPayload);
  page += F("'></div>");
  page += F("<div class='row' data-hfrole='card' data-ndef='text,vcard'><label>Payload</label><textarea name='hf_ndef_payload' maxlength='512'>");
  page += htmlEscape(config_.hfCardPayload);
  page += F("</textarea></div>");
  page += F("<div class='row' data-hfrole='card' data-ndef='wifi'><label>WiFi SSID</label><input name='hf_ndef_wifi_ssid' maxlength='32' value='");
  page += htmlEscape(config_.hfCardWifiSsid);
  page += F("'></div><div class='row' data-hfrole='card' data-ndef='wifi'><label>WiFi password</label><input name='hf_ndef_wifi_password' type='password' maxlength='64' value='");
  page += htmlEscape(config_.hfCardWifiPassword);
  page += F("'></div>");
  page += F("<div class='note' data-hfrole='card'>Card emulation uses NFC-A Type 4 Tag / NDEF. UID supports 4 or 7 hex bytes on ST25R3916.</div>");
  page += F("<div class='checks' data-hfrole='scan'>");
  page += F("<label><input type='checkbox' name='hf_tech_a'");
  page += (config_.hfTechs & RFAL_NFC_POLL_TECH_A) ? F(" checked") : F("");
  page += F(">ISO14443A</label><label><input type='checkbox' name='hf_tech_b'");
  page += (config_.hfTechs & RFAL_NFC_POLL_TECH_B) ? F(" checked") : F("");
  page += F(">ISO14443B</label><label><input type='checkbox' name='hf_tech_f'");
  page += (config_.hfTechs & RFAL_NFC_POLL_TECH_F) ? F(" checked") : F("");
  page += F(">NFC-F</label><label><input type='checkbox' name='hf_tech_v'");
  page += (config_.hfTechs & RFAL_NFC_POLL_TECH_V) ? F(" checked") : F("");
  page += F(">ISO15693</label></div>");
  page += F("<div class='note' data-hfrole='scan'>These protocol switches are used only by Scan mode.</div>");
  page += F("<div class='note'>HF SPI/I2C speed is fixed by command-line settings and is not shown here.</div></section>");

