wilson-elechouse/network_RFID/ESP32S3_LF_HF_Network_RFID/src/NetworkRfidReader.cpp
  page += F("<section><h2>Hotspot</h2>");
  page += F("<div class='row'><label>AP SSID</label><input name='portal_ssid' value='");
  page += htmlEscape(ap_ssid);
  page += F("'></div><div class='row'><label>AP password</label><input name='portal_password' type='password' value='");
  page += htmlEscape(config_.configPortalPassword);
  page += F("'></div><div class='row'><label>Portal port</label><input name='portal_port' type='number' min='1' max='65535' value='");
  page += String(config_.configPortalPort == 0 ? 80 : config_.configPortalPort);
  page += F("'></div></section>");

  page += F("<div class='actions'><button type='submit'>Save</button></form>");
  page += F("<form method='post' action='/reboot'><button class='secondary' type='submit'>Reboot</button></form></div>");
  page += F("</main></body></html>");

  portalServer_->send(200, "text/html", page);
}

void NetworkRfidReader::restartStation() {
  restartTcpSocket();
  if (config_.wifiSsid.length() == 0) {
    wifiConnectInProgress_ = false;
    WiFi.disconnect(false, true);
    if (portalRunning_) {
      WiFi.mode(WIFI_AP);
    }
    return;
  }

  wifiConnectInProgress_ = false;
  WiFi.disconnect(false, false);
  delay(50);
  startWifi();
}

String NetworkRfidReader::defaultPortalSsid() const {
  return String(F("ELECHOUSE_RFID"));
}

void NetworkRfidReader::startWifi() {
  if (config_.wifiSsid.length() == 0) {
    return;
  }
  const wl_status_t status = WiFi.status();
  if (status == WL_CONNECTED) {
    wifiConnectInProgress_ = false;
    return;
  }
  if (wifiConnectInProgress_ && (millis() - lastWifiBeginMs_) < kStationConnectTimeoutMs) {
    return;
  }

  WiFi.setHostname(NETWORK_RFID_WIFI_HOSTNAME);
  WiFi.mode(portalRunning_ ? WIFI_AP_STA : WIFI_STA);
  WiFi.setAutoReconnect(true);
  lastWifiDisconnectReason_ = 0;
  WiFi.begin(config_.wifiSsid.c_str(), config_.wifiPassword.c_str());
  lastWifiBeginMs_ = millis();
  wifiConnectInProgress_ = true;
}

void NetworkRfidReader::serviceNetwork() {
  serviceWifiStation();

  if (config_.tcpMode == NetworkRfidTcpMode::Off) {
    return;
  }

  if (WiFi.status() != WL_CONNECTED) {
    return;
  }

  if (config_.tcpMode == NetworkRfidTcpMode::Server) {
    if (server_ == nullptr || activeServerPort_ != config_.tcpListenPort) {
      restartTcpSocket();
    }
    if (server_ != nullptr) {
      WiFiClient incoming = server_->available();
      if (incoming) {
        if (serverClient_.connected()) {
          serverClient_.stop();
        }
        serverClient_ = incoming;
        serverClient_.setNoDelay(true);
        serverClientLine_ = "";
      }
    }
    serviceTcpCommands();
  } else if (config_.tcpMode == NetworkRfidTcpMode::Client ||
             config_.tcpMode == NetworkRfidTcpMode::ElechouseTest) {
    ensureTcpClient();
    serviceTcpCommands();
  }
}

void NetworkRfidReader::serviceWifiStation() {
  if (config_.wifiSsid.length() == 0) {
    return;
  }

  const wl_status_t status = WiFi.status();
  if (status == WL_CONNECTED) {
    wifiConnectInProgress_ = false;
    return;
  }

  const uint32_t now = millis();
  const uint32_t reconnect_ms = config_.tcpReconnectMs < 1000 ? 1000 : config_.tcpReconnectMs;
  if (wifiConnectInProgress_ && (now - lastWifiBeginMs_) < kStationConnectTimeoutMs) {
    return;
  }
  if ((now - lastWifiBeginMs_) < reconnect_ms) {
    return;
  }

  wifiConnectInProgress_ = false;
  WiFi.disconnect(false, false);
  delay(10);
  startWifi();
}

void NetworkRfidReader::restartTcpSocket() {
  if (tcpClient_.connected()) {
    tcpClient_.stop();
  }
  if (serverClient_.connected()) {
    serverClient_.stop();
  }
  if (server_ != nullptr) {
    server_->stop();
    delete server_;
    server_ = nullptr;
  }
  activeServerPort_ = 0;
  tcpClientLine_ = "";
  serverClientLine_ = "";
  elechouseHelloSent_ = false;
  elechouseBrokerOk_ = false;
  elechouseLastPingMs_ = 0;

  if (config_.tcpMode == NetworkRfidTcpMode::Server && WiFi.status() == WL_CONNECTED) {
    if (portalRunning_ && config_.tcpListenPort == (config_.configPortalPort == 0 ? 80 : config_.configPortalPort)) {
      if (console_ != nullptr) {
        console_->println(F("ERR tcp server port conflicts with portal port"));
      }
      return;
    }
    server_ = new WiFiServer(config_.tcpListenPort);
    server_->begin();
    activeServerPort_ = config_.tcpListenPort;
  }
}

bool NetworkRfidReader::ensureTcpClient() {
  const bool elechouse_mode = config_.tcpMode == NetworkRfidTcpMode::ElechouseTest;
  if ((config_.tcpMode != NetworkRfidTcpMode::Client && !elechouse_mode) ||
      WiFi.status() != WL_CONNECTED) {
    return false;
  }
  if (elechouse_mode) {
    if (config_.elechouseSessionCode.length() == 0) {
      return false;
    }
  } else if (config_.tcpHost.length() == 0) {
    return false;
  }
  if (tcpClient_.connected()) {
    return true;
  }

  const uint32_t now = millis();
  const uint32_t reconnect_ms = config_.tcpReconnectMs < 1000 ? 1000 : config_.tcpReconnectMs;
  if ((now - lastTcpConnectMs_) < reconnect_ms) {
    return false;
  }

  lastTcpConnectMs_ = now;
  tcpClient_.stop();
  elechouseHelloSent_ = false;
  elechouseBrokerOk_ = false;
  const char* host = elechouse_mode ? kElechouseBrokerHost : config_.tcpHost.c_str();
  const uint16_t port = elechouse_mode ? kElechouseBrokerPort : config_.tcpPort;
  if (tcpClient_.connect(host, port)) {
    tcpClient_.setNoDelay(true);
    tcpClientLine_ = "";
    if (elechouse_mode) {
      sendElechouseHello();
    }
    return true;
  }
  return false;
}

void NetworkRfidReader::sendNetworkLine(const String& line) {
  if (config_.tcpMode == NetworkRfidTcpMode::Off || !config_.tcpEchoEvents) {
    return;
  }

  if (config_.tcpMode == NetworkRfidTcpMode::ElechouseTest) {
    if (ensureTcpClient() && elechouseBrokerOk_) {
      tcpClient_.print(line);
    }
    return;
  }

  if (config_.tcpMode == NetworkRfidTcpMode::Client) {
    if (ensureTcpClient()) {
      tcpClient_.print(line);
    }
  } else if (config_.tcpMode == NetworkRfidTcpMode::Server) {
    if (serverClient_.connected()) {
      serverClient_.print(line);
    }
  }
}

