wilson-elechouse/network_RFID/ESP32S3_LF_HF_Network_RFID/src/NetworkRfidReader.cpp
  if (config_.productInterfaceMode == NetworkRfidProductInterfaceMode::Uart) {
    setupHardwareUart();
  } else {
    setupPulseInterface();
  }
}

void NetworkRfidReader::releaseProductInterface() {
  releaseHardwareUart();
  releasePulseInterface();
}

void NetworkRfidReader::restartProductInterface() {
  if (config_.hardwareUartEnabled) {
    setupProductInterface();
  } else {
    releaseProductInterface();
  }
}

void NetworkRfidReader::setupPulseInterface() {
  productInterfacePulseReady_ = false;

  if (!config_.hardwareUartEnabled ||
      config_.productInterfaceMode == NetworkRfidProductInterfaceMode::Uart ||
      config_.pins.hardwareUartRx < 0 ||
      config_.pins.hardwareUartTx < 0) {
    return;
  }

  pinMode(config_.pins.hardwareUartRx, OUTPUT_OPEN_DRAIN);
  pinMode(config_.pins.hardwareUartTx, OUTPUT_OPEN_DRAIN);
  digitalWrite(config_.pins.hardwareUartRx, HIGH);
  digitalWrite(config_.pins.hardwareUartTx, HIGH);
  productInterfacePulseReady_ = true;

  if (console_ != nullptr) {
    console_->print(F("Product interface ready mode="));
    console_->print(productInterfaceModeName(config_.productInterfaceMode));
    console_->print(F(" d0/clock="));
    console_->print(config_.pins.hardwareUartRx);
    console_->print(F(" d1/data="));
    console_->println(config_.pins.hardwareUartTx);
  }
}

void NetworkRfidReader::releasePulseInterface() {
  if (productInterfacePulseReady_) {
    if (config_.pins.hardwareUartRx >= 0) {
      pinMode(config_.pins.hardwareUartRx, INPUT);
    }
    if (config_.pins.hardwareUartTx >= 0) {
      pinMode(config_.pins.hardwareUartTx, INPUT);
    }
  }
  productInterfacePulseReady_ = false;
}

void NetworkRfidReader::sendProductInterfaceEvent(const RfidCardEvent& event) {
  if (!config_.hardwareUartEnabled || !config_.hardwareUartEchoEvents) {
    return;
  }

  if (config_.productInterfaceMode == NetworkRfidProductInterfaceMode::Wiegand) {
    sendWiegandEvent(event);
  } else if (config_.productInterfaceMode == NetworkRfidProductInterfaceMode::Aba) {
    sendAbaEvent(event);
  }
}

bool NetworkRfidReader::sendWiegandEvent(const RfidCardEvent& event) {
  if (!productInterfacePulseReady_ || !isSupportedWiegandBits(config_.wiegandBits)) {
    return false;
  }

  uint64_t value = 0;
  if (!eventDataValue(event, value)) {
    return false;
  }

  const uint8_t data_bits = config_.wiegandBits - 2U;
  if (data_bits < 64) {
    value &= (1ULL << data_bits) - 1ULL;
  }

  const uint8_t first_half = data_bits / 2U;
  const uint8_t second_half = data_bits - first_half;
  const uint64_t second_mask = second_half >= 64 ? UINT64_MAX : ((1ULL << second_half) - 1ULL);
  const uint64_t second_value = value & second_mask;
  const uint64_t first_value = value >> second_half;

  const bool even_parity = (countBits64(first_value) & 1U) != 0;
  const bool odd_parity = (countBits64(second_value) & 1U) == 0;

  sendWiegandBit(even_parity);
  for (int bit = data_bits - 1; bit >= 0; --bit) {
    sendWiegandBit((value & (1ULL << bit)) != 0);
  }
  sendWiegandBit(odd_parity);
  return true;
}

bool NetworkRfidReader::sendAbaEvent(const RfidCardEvent& event) {
  if (!productInterfacePulseReady_) {
    return false;
  }

  String digits = eventDataDecimal(event, config_.abaUseCardNumber);
  if (digits.length() == 0) {
    return false;
  }

  for (size_t i = 0; i < digits.length(); i++) {
    const char c = digits.charAt(i);
    if (c < '0' || c > '9') {
      return false;
    }
  }

  if (config_.abaDigits > 0) {
    while (digits.length() < config_.abaDigits) {
      digits = String('0') + digits;
    }
    if (digits.length() > config_.abaDigits) {
      digits = digits.substring(digits.length() - config_.abaDigits);
    }
  }

  uint8_t lrc = 0;
  sendAbaNibble(0x0B, lrc, true);
  for (size_t i = 0; i < digits.length(); i++) {
    sendAbaNibble(static_cast<uint8_t>(digits.charAt(i) - '0'), lrc, true);
    if ((i & 0x07U) == 0x07U) {
      delay(0);
    }
  }
  sendAbaNibble(0x0F, lrc, true);
  sendAbaNibble(lrc & 0x0F, lrc, false);
  digitalWrite(config_.pins.hardwareUartRx, HIGH);
  digitalWrite(config_.pins.hardwareUartTx, HIGH);
  return true;
}

void NetworkRfidReader::sendWiegandBit(bool bit) {
  const int pin = bit ? config_.pins.hardwareUartTx : config_.pins.hardwareUartRx;
  digitalWrite(pin, LOW);
  delayMicroseconds(config_.productPulseUs);
  digitalWrite(pin, HIGH);
  delayMicroseconds(config_.productPulseGapUs);
}

void NetworkRfidReader::sendAbaNibble(uint8_t value, uint8_t& lrc, bool includeInLrc) {
  value &= 0x0F;
  if (includeInLrc) {
    lrc ^= value;
  }

  uint8_t parity_count = 0;
  for (uint8_t bit = 0; bit < 4; bit++) {
    const bool one = (value & (1U << bit)) != 0;
    if (one) {
      parity_count++;
    }
    sendAbaBit(one);
  }
  sendAbaBit((parity_count & 1U) == 0);
}

void NetworkRfidReader::sendAbaBit(bool bit) {
  digitalWrite(config_.pins.hardwareUartTx, bit ? LOW : HIGH);
  delayMicroseconds(20);
  digitalWrite(config_.pins.hardwareUartRx, LOW);
  delayMicroseconds(config_.productPulseUs);
  digitalWrite(config_.pins.hardwareUartRx, HIGH);
  delayMicroseconds(config_.productPulseGapUs);
  digitalWrite(config_.pins.hardwareUartTx, HIGH);
}

void NetworkRfidReader::emitCard(const char* band, const char* type, const String& id) {
  RfidCardEvent event;
  event.band = band;
  event.type = type;
  event.id = id;
  event.ms = millis();

  if (shouldSuppressDuplicate(event)) {
    return;
  }

  triggerFeedbackSuccess();

  const String line = formatEvent(event);
  if (config_.echoEventsToSerial && primaryConsole_ != nullptr) {
    primaryConsole_->print(line);
  }
  if (config_.hardwareUartEchoEvents &&
      config_.productInterfaceMode == NetworkRfidProductInterfaceMode::Uart &&
      hardwareUartReady_) {
    hardwareUart_.print(line);
  }
  sendProductInterfaceEvent(event);
  if (config_.tcpMode == NetworkRfidTcpMode::ElechouseTest) {
    sendElechouseCard(event);
  } else {
    sendNetworkLine(line);
  }

  if (callback_ != nullptr) {
    callback_(event, callbackContext_);
  }
}

bool NetworkRfidReader::shouldSuppressDuplicate(const RfidCardEvent& event) {
  String key = event.band;
  key += '|';
  key += event.type;
  key += '|';
  key += event.id;

