wilson-elechouse/network_RFID/ESP32S3_LF_HF_Network_RFID/src/NetworkRfidReader.cpp
  console_->print(F("interface="));
  console_->print(productInterfaceModeName(config_.productInterfaceMode));
  console_->print(F(" enabled="));
  console_->print(config_.hardwareUartEnabled ? F("on") : F("off"));
  console_->print(F(" uartReady="));
  console_->print(hardwareUartReady_ ? F("yes") : F("no"));
  console_->print(F(" pulseReady="));
  console_->print(productInterfacePulseReady_ ? F("yes") : F("no"));
  console_->print(F(" baud="));
  console_->print(config_.hardwareUartBaud);
  console_->print(F(" rxD0Clock="));
  console_->print(config_.pins.hardwareUartRx);
  console_->print(F(" txD1Data="));
  console_->print(config_.pins.hardwareUartTx);
  console_->print(F(" events="));
  console_->print(config_.hardwareUartEchoEvents ? F("on") : F("off"));
  console_->print(F(" commands="));
  console_->print(config_.hardwareUartCommands ? F("on") : F("off"));
  console_->print(F(" wgBits="));
  console_->print(config_.wiegandBits);
  console_->print(F(" pulseUs="));
  console_->print(config_.productPulseUs);
  console_->print(F(" gapUs="));
  console_->print(config_.productPulseGapUs);
  console_->print(F(" abaDigits="));
  if (config_.abaDigits == 0) {
    console_->print(F("auto"));
  } else {
    console_->print(config_.abaDigits);
  }
  console_->print(F(" abaSource="));
  console_->println(config_.abaUseCardNumber ? F("cn") : F("raw"));
}

void NetworkRfidReader::printPins() {
  if (console_ == nullptr) {
    return;
  }
  console_->print(F("LF OUT="));
  console_->print(config_.pins.lfOut);
  console_->print(F(" DATA="));
  console_->print(config_.pins.lfData);
  console_->print(F(" PULL="));
  console_->print(config_.pins.lfPull);
  console_->print(F(" ADC="));
  console_->print(config_.pins.lfAdc);
  console_->print(F(" CARRIER="));
  console_->println(config_.pins.lfCarrierDetect);

  console_->print(F("HF mode="));
  console_->print(hfBusModeName(config_.pins.hfBusMode));
  console_->print(F(" spiBus="));
  console_->print(config_.pins.hfSpiBus);
  console_->print(F(" SCK/SCL="));
  console_->print(config_.pins.hfSck);
  console_->print(F(" MOSI="));
  console_->print(config_.pins.hfMosi);
  console_->print(F(" MISO/SDA="));
  console_->print(config_.pins.hfMiso);
  console_->print(F(" CS="));
  console_->print(config_.pins.hfCs);
  console_->print(F(" IRQ="));
  console_->print(config_.pins.hfIrq);
  console_->print(F(" RESET="));
  console_->print(config_.pins.hfReset);
  console_->print(F(" SPI="));
  console_->print(config_.hfSpiHz);
  console_->print(F(" I2C="));
  console_->println(config_.hfI2cHz);

  console_->print(F("FEEDBACK LED="));
  console_->print(config_.pins.feedbackLed);
  console_->print(F(" BUZZER="));
  console_->print(config_.pins.feedbackBuzzer);
  console_->print(F(" BUZZER_CH="));
  console_->println(config_.pins.feedbackBuzzerLedcChannel);

  console_->print(F("BUTTON="));
  console_->print(config_.pins.configButton);
  console_->print(F(" ACTIVE_LOW="));
  console_->println(config_.pins.configButtonActiveLow ? F("yes") : F("no"));

  console_->print(F("PRODUCT RX/D0/CLOCK="));
  console_->print(config_.pins.hardwareUartRx);
  console_->print(F(" TX/D1/DATA="));
  console_->print(config_.pins.hardwareUartTx);
  console_->print(F(" BAUD="));
  console_->print(config_.hardwareUartBaud);
  console_->print(F(" MODE="));
  console_->println(productInterfaceModeName(config_.productInterfaceMode));
}

bool NetworkRfidReader::parseBoolForm(WebServer* server, const char* name) {
  return server != nullptr && server->hasArg(name);
}

uint16_t NetworkRfidReader::parsePortForm(WebServer* server, const char* name, uint16_t fallback) {
  if (server == nullptr || !server->hasArg(name)) {
    return fallback;
  }
  const int value = server->arg(name).toInt();
  if (value <= 0 || value > 65535) {
    return fallback;
  }
  return static_cast<uint16_t>(value);
}

uint32_t NetworkRfidReader::parseUIntForm(WebServer* server, const char* name, uint32_t fallback) {
  if (server == nullptr || !server->hasArg(name)) {
    return fallback;
  }
  String value = server->arg(name);
  value.trim();
  if (value.length() == 0) {
    return fallback;
  }
  return static_cast<uint32_t>(value.toInt());
}

String NetworkRfidReader::nextToken(String& rest) {
  rest.trim();
  if (rest.length() == 0) {
    return "";
  }
  const int pos = rest.indexOf(' ');
  if (pos < 0) {
    const String token = rest;
    rest = "";
    return token;
  }
  const String token = rest.substring(0, pos);
  rest = rest.substring(pos + 1);
  rest.trim();
  return token;
}

String NetworkRfidReader::lowerCopy(String value) {
  value.toLowerCase();
  return value;
}

String NetworkRfidReader::hexBytes(const uint8_t* data, size_t length, bool spaces) {
  static const char hex[] = "0123456789ABCDEF";
  String out;
  out.reserve((length * 3) + 1);
  for (size_t i = 0; i < length; i++) {
    if (spaces && i > 0) {
      out += ' ';
    }
    out += hex[(data[i] >> 4) & 0x0F];
    out += hex[data[i] & 0x0F];
  }
  return out;
}

String NetworkRfidReader::htmlEscape(const String& value) {
  String out;
  out.reserve(value.length() + 8);
  for (size_t i = 0; i < value.length(); i++) {
    const char c = value.charAt(i);
    if (c == '&') {
      out += F("&amp;");
    } else if (c == '<') {
      out += F("&lt;");
    } else if (c == '>') {
      out += F("&gt;");
    } else if (c == '"') {
      out += F("&quot;");
    } else if (c == '\'') {
      out += F("&#39;");
    } else {
      out += c;
    }
  }
  return out;
}

String NetworkRfidReader::jsonEscape(const String& value) {
  String out;
  out.reserve(value.length() + 4);
  for (size_t i = 0; i < value.length(); i++) {
    const char c = value.charAt(i);
    if (c == '\\' || c == '"') {
      out += '\\';
      out += c;
    } else if (c == '\n') {
      out += F("\\n");
    } else if (c == '\r') {
      out += F("\\r");
    } else if (c == '\t') {
      out += F("\\t");
    } else {
      out += c;
    }
  }
  return out;
}

const char* NetworkRfidReader::tcpModeName(NetworkRfidTcpMode mode) {
  switch (mode) {
    case NetworkRfidTcpMode::Client:
      return "client";
    case NetworkRfidTcpMode::Server:
      return "server";
    case NetworkRfidTcpMode::ElechouseTest:
      return "elechouse";
    case NetworkRfidTcpMode::Off:
    default:
      return "off";
  }
}

const char* NetworkRfidReader::wifiStatusName(wl_status_t status) {
  switch (status) {
    case WL_IDLE_STATUS:
      return "IDLE";
    case WL_NO_SSID_AVAIL:
      return "NO_SSID_AVAIL";
    case WL_SCAN_COMPLETED:
      return "SCAN_COMPLETED";
    case WL_CONNECTED:
      return "CONNECTED";
    case WL_CONNECT_FAILED:
      return "CONNECT_FAILED";
    case WL_CONNECTION_LOST:
      return "CONNECTION_LOST";
    case WL_DISCONNECTED:
      return "DISCONNECTED";
    case WL_STOPPED:
      return "STOPPED";
    case WL_NO_SHIELD:
      return "NO_SHIELD";
    default:
      return "UNKNOWN";
  }
}

const char* NetworkRfidReader::slotName(NetworkRfidSlot slot) {
  return slot == NetworkRfidSlot::HF ? "HF" : "LF";
}

