wilson-elechouse/network_RFID/ESP32S3_LF_HF_Network_RFID/src/NetworkRfidReader.cpp
const char* NetworkRfidReader::hfBusModeName(NetworkRfidHfBusMode mode) {
  return mode == NetworkRfidHfBusMode::I2c ? "i2c" : "spi";
}

const char* NetworkRfidReader::hfRoleName(NetworkRfidHfRole role) {
  switch (role) {
    case NetworkRfidHfRole::CardEmulation:
      return "card";
    case NetworkRfidHfRole::P2p:
      return "p2p";
    case NetworkRfidHfRole::Scan:
    default:
      return "scan";
  }
}

const char* NetworkRfidReader::hfCardPayloadTypeName(NetworkRfidHfCardPayloadType type) {
  switch (type) {
    case NetworkRfidHfCardPayloadType::Text:
      return "text";
    case NetworkRfidHfCardPayloadType::Vcard:
      return "vcard";
    case NetworkRfidHfCardPayloadType::Wifi:
      return "wifi";
    case NetworkRfidHfCardPayloadType::Url:
    default:
      return "url";
  }
}

const char* NetworkRfidReader::productInterfaceModeName(NetworkRfidProductInterfaceMode mode) {
  switch (mode) {
    case NetworkRfidProductInterfaceMode::Wiegand:
      return "wiegand";
    case NetworkRfidProductInterfaceMode::Aba:
      return "aba";
    case NetworkRfidProductInterfaceMode::Uart:
    default:
      return "uart";
  }
}

const char* NetworkRfidReader::hfTypeName(rfalNfcDevType type) {
  switch (type) {
    case RFAL_NFC_LISTEN_TYPE_NFCA:
    case RFAL_NFC_POLL_TYPE_NFCA:
      return "ISO14443A";
    case RFAL_NFC_LISTEN_TYPE_NFCB:
    case RFAL_NFC_POLL_TYPE_NFCB:
      return "ISO14443B";
    case RFAL_NFC_LISTEN_TYPE_NFCF:
    case RFAL_NFC_POLL_TYPE_NFCF:
      return "NFC-F";
    case RFAL_NFC_LISTEN_TYPE_NFCV:
    case RFAL_NFC_POLL_TYPE_NFCV:
      return "ISO15693";
    case RFAL_NFC_LISTEN_TYPE_ST25TB:
      return "ST25TB";
    case RFAL_NFC_LISTEN_TYPE_AP2P:
    case RFAL_NFC_POLL_TYPE_AP2P:
      return "AP2P";
    default:
      return "HF-UNKNOWN";
  }
}

const char* NetworkRfidReader::hfLmStateName(rfalLmState state) {
  switch (state) {
    case RFAL_LM_STATE_POWER_OFF:
      return "POWER_OFF";
    case RFAL_LM_STATE_IDLE:
      return "IDLE";
    case RFAL_LM_STATE_READY_A:
      return "READY_A";
    case RFAL_LM_STATE_READY_B:
      return "READY_B";
    case RFAL_LM_STATE_READY_F:
      return "READY_F";
    case RFAL_LM_STATE_ACTIVE_A:
      return "ACTIVE_A";
    case RFAL_LM_STATE_CARDEMU_4A:
      return "CARDEMU_4A";
    case RFAL_LM_STATE_CARDEMU_4B:
      return "CARDEMU_4B";
    case RFAL_LM_STATE_CARDEMU_3:
      return "CARDEMU_3";
    case RFAL_LM_STATE_TARGET_A:
      return "TARGET_A";
    case RFAL_LM_STATE_TARGET_F:
      return "TARGET_F";
    case RFAL_LM_STATE_SLEEP_A:
      return "SLEEP_A";
    case RFAL_LM_STATE_SLEEP_B:
      return "SLEEP_B";
    case RFAL_LM_STATE_READY_Ax:
      return "READY_Ax";
    case RFAL_LM_STATE_ACTIVE_Ax:
      return "ACTIVE_Ax";
    case RFAL_LM_STATE_SLEEP_AF:
      return "SLEEP_AF";
    case RFAL_LM_STATE_NOT_INIT:
    default:
      return "NOT_INIT";
  }
}

bool NetworkRfidReader::isHfP2pDevice(const rfalNfcDevice* device) {
  if (device == nullptr) {
    return false;
  }
  return device->rfInterface == RFAL_NFC_INTERFACE_NFCDEP ||
         device->type == RFAL_NFC_LISTEN_TYPE_AP2P ||
         device->type == RFAL_NFC_POLL_TYPE_AP2P;
}

bool NetworkRfidReader::parseHexBytes(const String& value, uint8_t* data, size_t maxLength, size_t& length) {
  length = 0;
  if (data == nullptr || maxLength == 0) {
    return false;
  }

  int high_nibble = -1;
  for (size_t i = 0; i < value.length(); i++) {
    const char c = value.charAt(i);
    int nibble = -1;
    if (c >= '0' && c <= '9') {
      nibble = c - '0';
    } else if (c >= 'a' && c <= 'f') {
      nibble = c - 'a' + 10;
    } else if (c >= 'A' && c <= 'F') {
      nibble = c - 'A' + 10;
    } else if (c == ' ' || c == ':' || c == '-' || c == ',') {
      continue;
    } else {
      return false;
    }

    if (high_nibble < 0) {
      high_nibble = nibble;
      continue;
    }

    if (length >= maxLength) {
      return false;
    }
    data[length++] = static_cast<uint8_t>((high_nibble << 4) | nibble);
    high_nibble = -1;
  }

  return high_nibble < 0 && length > 0;
}

bool NetworkRfidReader::isValidElechouseSessionCode(const String& value) {
  if (value.length() == 0 || value.length() > 64) {
    return false;
  }
  for (size_t i = 0; i < value.length(); i++) {
    const char c = value.charAt(i);
    const bool ok = (c >= '0' && c <= '9') ||
                    (c >= 'a' && c <= 'z') ||
                    (c >= 'A' && c <= 'Z') ||
                    c == '_' || c == '.' || c == ':' || c == '-';
    if (!ok) {
      return false;
    }
  }
  return true;
}

bool NetworkRfidReader::parseEventDataBytes(const String& id, uint8_t* data, size_t maxLength, size_t& length) {
  length = 0;
  if (data == nullptr || maxLength == 0) {
    return false;
  }

  String source = id;
  String lower = lowerCopy(source);
  const int raw_pos = lower.indexOf("raw=");
  if (raw_pos >= 0) {
    source = source.substring(raw_pos + 4);
  } else {
    const int bit_pos = lower.indexOf("-bit");
    if (bit_pos >= 0) {
      const int space_pos = source.indexOf(' ', bit_pos);
      if (space_pos >= 0) {
        source = source.substring(space_pos + 1);
      }
    }
  }

  lower = lowerCopy(source);
  const int ascii_pos = lower.indexOf(" ascii=");
  if (ascii_pos >= 0) {
    source = source.substring(0, ascii_pos);
  }
  source.trim();

  int high_nibble = -1;
  for (size_t i = 0; i < source.length(); i++) {
    const char c = source.charAt(i);
    int nibble = -1;
    if (c >= '0' && c <= '9') {
      nibble = c - '0';
    } else if (c >= 'a' && c <= 'f') {
      nibble = c - 'a' + 10;
    } else if (c >= 'A' && c <= 'F') {
      nibble = c - 'A' + 10;
    } else if (c == ' ' || c == ':' || c == '-' || c == ',' || c == '\t') {
      continue;
    } else {
      return length > 0 && high_nibble < 0;
    }

    if (high_nibble < 0) {
      high_nibble = nibble;
      continue;
    }

    if (length >= maxLength) {
      return false;
    }
    data[length++] = static_cast<uint8_t>((high_nibble << 4) | nibble);
    high_nibble = -1;
  }

