wilson-elechouse/network_RFID/ESP32S3_LF_HF_Network_RFID/src/NetworkRfidReader.cpp
  return high_nibble < 0 && length > 0;
}

bool NetworkRfidReader::eventDataValue(const RfidCardEvent& event, uint64_t& value) {
  value = 0;
  uint8_t bytes[16] = {};
  size_t length = 0;
  if (!parseEventDataBytes(event.id, bytes, sizeof(bytes), length)) {
    String digits;
    if (extractDecimalField(event.id, "CN=", digits)) {
      for (size_t i = 0; i < digits.length(); i++) {
        value = (value * 10ULL) + static_cast<uint64_t>(digits.charAt(i) - '0');
      }
      return true;
    }
    return false;
  }

  const size_t start = length > 8 ? length - 8 : 0;
  for (size_t i = start; i < length; i++) {
    value = (value << 8) | bytes[i];
  }
  return true;
}

String NetworkRfidReader::eventDataDecimal(const RfidCardEvent& event, bool useCardNumber) {
  String digits;
  if (useCardNumber && extractDecimalField(event.id, "CN=", digits)) {
    return digits;
  }

  String id = event.id;
  id.trim();
  bool decimal_only = id.length() > 0;
  for (size_t i = 0; i < id.length(); i++) {
    const char c = id.charAt(i);
    if (c < '0' || c > '9') {
      decimal_only = false;
      break;
    }
  }
  if (decimal_only) {
    return id;
  }

  uint64_t value = 0;
  if (eventDataValue(event, value)) {
    return uint64ToDecimalString(value);
  }

  if (extractDecimalField(event.id, "CN=", digits)) {
    return digits;
  }
  return "";
}

bool NetworkRfidReader::extractDecimalField(const String& value, const char* field, String& digits) {
  digits = "";
  if (field == nullptr) {
    return false;
  }

  String lower_value = lowerCopy(value);
  String lower_field = field;
  lower_field.toLowerCase();
  const int pos = lower_value.indexOf(lower_field);
  if (pos < 0) {
    return false;
  }

  const size_t start = static_cast<size_t>(pos) + strlen(field);
  for (size_t i = start; i < value.length(); i++) {
    const char c = value.charAt(i);
    if (c < '0' || c > '9') {
      break;
    }
    digits += c;
  }
  return digits.length() > 0;
}

String NetworkRfidReader::uint64ToDecimalString(uint64_t value) {
  char buffer[21] = {};
  size_t index = sizeof(buffer) - 1;
  buffer[index] = '\0';
  do {
    buffer[--index] = static_cast<char>('0' + (value % 10ULL));
    value /= 10ULL;
  } while (value > 0 && index > 0);
  return String(&buffer[index]);
}

uint8_t NetworkRfidReader::countBits64(uint64_t value) {
  uint8_t count = 0;
  while (value != 0) {
    count += static_cast<uint8_t>(value & 1ULL);
    value >>= 1;
  }
  return count;
}

String NetworkRfidReader::asciiPreview(const uint8_t* data, size_t length) {
  if (data == nullptr || length == 0) {
    return "";
  }

  String out;
  out.reserve(length);
  for (size_t i = 0; i < length; i++) {
    const uint8_t c = data[i];
    if (c < 0x20 || c > 0x7E) {
      return "";
    }
    if (c == '\\' || c == '"') {
      out += '\\';
    }
    out += static_cast<char>(c);
  }
  return out;
}
